const startLevel = 21;
const endLevel = 42;

const cardsContainer = document.getElementById("cardsContainer");
const levelsList = document.getElementById("levelsList");
const dashboard = document.getElementById("dashboard");
const levelsPage = document.getElementById("levelsPage");
const header = document.getElementById("mainHeader");
const levelText = document.getElementById("levelText");
const copyMsg = document.getElementById("copyMsg");
const homeBtn = document.getElementById("homeBtn");

/* ===== قاعدة بيانات نصوص المستويات مع الاتجاه الصحيح لكل لغة ===== */
const levelContentData = {
21: `<pre dir="rtl">السؤال الاول


أنشئ برنامجًا كما يلي:

① أعلن متغيّرًا باسم science وأسند إليه 100
② إذا كان "science يساوي 100"، فاطبع "Reward: steak" في وحدة التحكم


الاجابة


let science = 100;
if (science == 100) {
console.log("Reward: steak");
}






السؤال الثاني


يرجى إنشاء برنامج يطبع "Reward: steak" 
إذا كانت قيمة science تساوي 100، و"Reward: ice cream" 
إذا كانت science أكبر من أو تساوي 80، وإلا فاطبع "No games for 1 week."

بدءًا من السطر 4، أنشئ برنامجًا كما يلي:
① وإلا، إذا كان "المتغيّر science أكبر من أو يساوي 80" فاطبع "Reward: ice cream"
② وإلا فاطبع "No games for 1 week."



الاجابة
نكتب من السطر الرابع الي السطر الثامن هذا الكود


} else if ( science >= 80 ){
console.log("Reward: ice cream");
} else {
console.log("No games for 1 week.");
}




ليكون شكل الكود النهائي


let science = 80;
if (science == 100) {
console.log("Reward: steak");
} else if ( science >= 80 ){
console.log("Reward: ice cream");
} else {
console.log("No games for 1 week.");
}


..............................................................................

الدرس الثاني


السؤال الاول

أدخل الشرط: إذا كان المتغيّر score أكبر من أو يساوي 80.

الاجابة
نكتب في المكان المخصص لكتابه الكود
score >= 80


ليكون شكل الكود النهائي
let score = 100;
if (score >= 80) {
console.log("Pass");
}








السؤال الثاني

أدخل الشرط: إذا كان المتغيّر score أصغر من أو يساوي 40.

الاجابة
نكتب في المكان المخصص لكتابه الكود
score <= 40
ليكون شكل الكود النهائي
let score = 30;
if (score <= 40) {
console.log("Retest");
}






السؤال الثالث
أدخل الشرط: إذا كان numberOfPeople أكبر من أو يساوي 3 AND والمبلغ الإجمالي يساوي 3333 codycoins.


الاجابة
نكتب في المكان المخصص لكتابه الكود

numberOfPeople >= 3 && total == 3333

ليكون شكل الكود النهائي

let numberOfPeople = 3;
let total = 3333;
if (numberOfPeople >= 3 && total == 3333) {
console.log("30% discount");
}







السؤال الرابع
أدخل الشرط: إذا كان numberOfPeople 
أكبر من أو يساوي 10 OR وكان المبلغ الإجمالي أكبر من أو يساوي 12000 codycoins.


الاجابة
نكتب في المكان المخصص لكتابه الكود

numberOfPeople >= 10 || total >= 12000


ليكون شكل الكود النهائي

let numberOfPeople = 4;
let total = 13500;
if (numberOfPeople >= 10 || total >= 12000) {
console.log("Small Gift Present");
}



...................................................................

الدرس الثالث


السؤال الاول

انقر "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط





السؤال الثاني

انقر "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط





سؤال
هل سينتج عن هذا البرنامج خطأ؟
let science = 100;
let bonus = 5000;
if (science == 100) {
console.log(bonus + " codycoins GET");
}

الاجابة

النتيجة: لا ينتج عنه خطأ





سؤال

هل سينتج عن هذا البرنامج خطأ؟
let science = 100;
if (science == 100) {
let bonus = 5000;
}
console.log(bonus + " codycoins GET");

الاجابة

النتيجة: ينتج عنه خطأ







السؤال الثالث

انقر "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط






سؤال

هل سينتج عن هذا البرنامج خطأ؟
let score = 100;
if (score == 100) {
let treat = "book voucher";
}
console.log(treat + " GET");

الاجابة

النتيجة: ينتج عنه خطأ





...........................................................................


الدرس الرابع


السؤال الاول

هذا البرنامج يطبع "Test Passed" إذا كان المتغيّر score أكبر من أو يساوي 80، ومن بين تلك الحالات، 
إذا كان المتغيّر rank يساوي 1، يطبع "Trophy Acquired".
لنتحقق من المخرجات عندما يكون score = 90 و rank = 1.


الاجابة

نضغط علي تشغيل الكود فقط





السؤال الثاني

لنتحقق من المخرجات عند تغيير المتغيّر rank من 1 إلى 3.

الاجابة

نضغط علي تشغيل الكود فقط






السؤال الثالث

لنتحقق من المخرجات عند تغيير المتغيّر score من 90 إلى 75 وإرجاع المتغيّر rank إلى 1.

الاجابة

نضغط علي تشغيل الكود فقط



..................................................................................


الدرس الخامس


السؤال الاول


أنشئ برنامجًا كما يلي:

(1) أعلن متغيّرًا باسم score وأسند إليه 90
(2) إذا كان المتغيّر score أكبر من أو يساوي 80، فاطبع "Test Passed" إلى وحدة التحكم


الاجابة

let score = 90;
if (score >= 80) {
console.log("Test Passed");
}






السؤال الثاني

سننشئ برنامجًا يطبع "Test Passed" إذا كان المتغيّر score أكبر من أو يساوي 80، ومن بين تلك الحالات، 
إذا كان المتغيّر rank يساوي 1، يطبع "Trophy Acquired".

أدخل البرنامج كما يلي، مع الانتباه لمواضع عبارات if:
let score = 90;
let rank = 1;
if (score >= 80) {
console.log(""Test Passed"");
if (rank == 1) {
console.log(""Trophy Acquired"");
}
}


الاجابة

مسح او تعديل الكود ليصبح هكذا

let score = 90;
let rank = 1;
if (score >= 80) {
console.log("Test Passed");
if (rank == 1) {
console.log("Trophy Acquired");
}
}







السؤال الثالث

أنشئ برنامجًا كما يلي:

① أعلن متغيّرًا باسم rank وأسند إليه 1
② إذا كان المتغيّر rank يساوي 1، فاطبع "Regional Champion" في وحدة التحكم

الاجابة

let rank = 1;
if (rank == 1) {
console.log("Regional Champion");
}






السؤال الرابع

أنشئ برنامجًا كما يلي:

① في السطر 2، أعلن متغيّرًا باسم fishCaught وأسند إليه 27
② إذا كان المتغيّر fishCaught أكبر من أو يساوي 30، فاطبع "New Tournament Record" في وحدة التحكم


الاجابة

مسح او تعديل الكود ليصبح هكذا

let rank = 1;
let fishCaught = 27;
if (rank == 1) {
console.log("Regional Champion");
if (fishCaught >= 30) {
console.log("New Tournament Record");
}
}






....................................................................................


مراجعة المستوي 21
حل مراجعة المستوي 21


السؤال الاول

اختر التعبير الصحيح للشرط "المتغيّر score يساوي 50".


الاجابة

score == 50





السؤال الثاني

أضف شرطًا ثانيًا إلى البرنامج المكتوب:
إذا كان A أصغر من B، اطبع "B is larger" في وحدة التحكم (console).
سيُكتب الشرط الثاني على الشكل التالي: "A < B".


الاجابة

نكتب في المكان المخصص لكتابة الكود

else if(A < B)

شكل الكود النهائي

let A = 5
let B = 10
if (A > B) {
console.log("A is larger");
} else if(A < B) {
console.log("B is larger");
}






السؤال الثالث

اختر التعبير الصحيح للشرط "A أصغر من B".


الاجابة

A < B







السؤال الرابع

اختر البرنامج الذي يمثّل الشرط "المتغيّر score أكبر من أو يساوي 50".


الاجابة

score >= 50







السؤال الخامس

اختر العامل (operator) الصحيح الذي يمثّل "تحقّق عدّة شروط في الوقت نفسه" (AND).


الاجابة

&&







السؤال السادس

اختر العامل (operator) الصحيح الذي يمثّل "تحقّق شرط واحد على الأقل من عدّة شروط" (OR).


الاجابة

||






السؤال السابع

اكتب شرطًا ينص على أن "عدد الأشخاص أصغر من أو يساوي 10" أو "الوزن الكلي أصغر من أو يساوي 800kg".
المتغيّر لعدد الأشخاص هو numberOfPeople، والمتغيّر للوزن الكلي هو weight.

الاجابة

نكتب في المكان المخصص لكتابة الكود

numberOfPeople <= 10 || weight <= 800


شكل الكود النهائي

let numberOfPeople = 8;
let weight = 400;
if (numberOfPeople <= 10 || weight <= 800) {
console.log("You can ride the elevator");
}






السؤال الثامن

اختر نتيجة الإخراج (output) للبرنامج التالي:

let math = 100;
if (math == 100) {
let fee = 500;
}
console.log(fee + " codycoins GET");


الاجابة

ينتج عنه خطأ








السؤال التاسع

أنشئ برنامجًا يطبع "Math is 100 points" إذا كان math يساوي 100 نقطة، 
ومن بين هذه الحالات، إذا كان science أيضًا يساوي 100 نقطة، يطبع "Math and science are 100 points" في وحدة التحكم (console).
ولكن لا تستخدم "&&" التي تعني AND.


الاجابة

مسح او تعديل الكود ليصبح هكذا

let math = 100;
let science = 100;
if (math == 100) {
console.log("Math is 100 points");
if (science == 100) {
console.log("Math and science are 100 points");
}
}
</pre>
`,
22: `<pre dir="rtl">السؤال الاول

اضغط على "تشغيل الكود" دون تعديل البرنامج.

نضغط علي تشغيل الكود





السؤال الثاني

سننشئ برنامجًا يطبع "She sells seashells by the seashore." عدد 3 مرات.

أدخل البرنامج كما يلي:
for ( let i = 0; i < 3; i++ ) {
console.log("She sells seashells by the seashore.");

الاجابة

نكتب في المكان المخصص لكتابه الكود

for ( let i = 0; i < 3; i++ )

شكل الكود النهائي

for ( let i = 0; i < 3; i++ ) {
console.log("She sells seashells by the seashore.");
}





السؤال الثالث

استخدم حلقة for لطباعة "Six slippery snails slid slowly seaward." في وحدة التحكم 3 مرات.

الاجابة

نكتب في المكان المخصص لكتابة الكود

for ( let i = 0; i < 3; i++ )

شكل الكود النهائي

for ( let i = 0; i < 3; i++ ) {
console.log("Six slippery snails slid slowly seaward.");
}






السؤال الرابع

استخدم حلقة for لطباعة "silk" في وحدة التحكم 10 مرات.

الاجابة

for ( let i = 0; i < 10; i++ ) {
console.log("silk");
}


..................................................................................................................................................


الدرس الثاني


السؤال الاول

اضغط على "تشغيل الكود" دون تعديل البرنامج.

نضغط علي تشغيل الكود فقط





السؤال الثاني

اضغط على "تشغيل الكود" دون تعديل البرنامج.

نضغط علي تشغيل الكود فقط





سؤال

ماذا نسمّي “النطاق الذي يمكن الوصول فيه إلى المتغير"؟

الاجابة

Scope





سؤال

هل سينتج عن هذا البرنامج خطأ؟

for (let i = 0; i < 5; i++) {
console.log(i);
}
console.log(i);


الاجابة

ينتج عنه خطأ





سؤال

هل سينتج عن هذا البرنامج خطأ؟

for (let i = 0; i < 5; i++) {
console.log(i);
}


الاجابة

لا ينتج عنه خطأ




سؤال

هل سينتج عن هذا البرنامج خطأ؟

for (let i = 0; i < 3; i++) {
let num = 100;
console.log(num);
}

الاجابة

لا ينتج عنه خطأ






..................................................................................................................................................

الدرس الثالث

سؤال

ما العادة اليومية التي بدأ ريكي مؤخرًا؟

الاجابة

تمارين البطن




السؤال الاول

اضغط على "تشغيل الكود" دون تعديل البرنامج.

نضغط علي تشغيل الكود






السؤال الثاني

سننشئ برنامجًا يطبع "sit-up, sit-up, sit-up, running, sit-up, sit-up".

أنشئ برنامجًا كما يلي:
(1) استخدم حلقة for لطباعة "sit-up" في وحدة التحكم 5 مرات
*أعلن المتغيّر باسم i

الاجابة

for (let i = 0; i < 5; i++) {
console.log("sit-up");
}




السؤال الثالث

سننشئ برنامجًا يطبع "sit-up, sit-up, sit-up, running, sit-up, sit-up".

أدخل البرنامج كما يلي:

for (let i = 0; i < 5; i++) {
console.log("sit-up");
if (i == 2) {
console.log("running");
}
}


الاجابة

نسمح او نعدل الكود ليكون هكذا

for (let i = 0; i < 5; i++) {
console.log("sit-up");
if (i == 2) {
console.log("running");
}
}


.................................................................................................................................................

الدرس الرابع

السؤال الاول


سننشئ برنامجًا يطبع "lunch box, lunch box, library book, lunch box, lunch box, lunch box".

أنشئ برنامجًا كما يلي:
(1) استخدم حلقة for لطباعة "lunch box" في وحدة التحكم 5 مرات
* أعلن المتغيّر باسم i

الاجابة

for (let i = 0; i < 5; i++) {
console.log("lunch box");
}






السؤال الثاني

سننشئ برنامجًا يطبع "lunch box, lunch box, library book, lunch box, lunch box, lunch box".

أَنشِئ وأدخِل البرنامج في السطر 3 كما يلي:
① إذا كان المتغيّر i يساوي 1، اطبع "library book" إلى وحدة التحكم

الاجابة

مسح او تعديل الكود ليصبح هكذا

for (let i = 0; i < 5; i++) {
console.log("lunch box");
if (i == 1) {
console.log("library book");
}
}






السؤال الثالث

سننشئ برنامجًا يطبع "lunch box, lunch box, lunch box, lunch box, fruit, lunch box".

أنشئ برنامجًا كما يلي:
① استخدم حلقة for لطباعة "lunch box" في وحدة التحكم 5 مرات
　* أعلن المتغيّر باسم i
② بعد طباعة "lunch box" للمرة الرابعة، اطبع "fruit" إلى وحدة التحكم

الاجابة

for (let i = 0; i < 5; i++) {
console.log("lunch box");
if (i == 3) {
console.log("fruit");
}
}



...............................................................................................................................................

الدرس الخامس

السؤال الاول

أنشئ برنامجًا كما يلي:
let i = 0;
i += 3;
console.log(i);

الاجابة

مسح او تعديل الكود ليصبح هكذا

let i = 0;
i += 3;
console.log(i);







السؤال الثاني

سننشئ برنامجًا يطبع المتغيّر num.

أنشئ برنامجًا في السطر 2 كما يلي:
(1) أَسنِد 5 إلى المتغيّر num
* ولكن اكتب برنامجًا غير num = num + 5.

الاجابة

مسح او تعديل الكود ليصبح هكذا

let num = 0;
num += 5;
console.log(num);


.................................................................................................................................................

مراجعة المستوي 22
حل مراجعة المستوي 22


السؤال الاول

الرجاء اختيار ما يجب كتابته في بداية البرنامج الذي يعبّر عن: تكرار طباعة "apple" على وحدة التحكم 10 مرات.

الاجابة

for





السؤال الثاني

الرجاء اختيار البرنامج الصحيح لإضافة 1 إلى المتغيّر i.

الاجابة

i++






السؤال الثالث

الرجاء اختيار البرنامج الصحيح لتكرار عملية محددة 10 مرات.

الاجابة

for (let i = 0; i < 10; i++) {
specified process;
}






السؤال الرابع

اكتب برنامجًا كما يلي:

① اطبع "Programming" على وحدة التحكم 3 مرات
* استخدم اسم المتغيّر i وأعطه في البداية القيمة 0.
* استخدم عامل الزيادة (increment operator).

الاجابة

نكتب في المكان المخصص الكود التالي

let i = 0; i < 3; i++

شكل الكود النهائي

for (let i = 0; i < 3; i++) {
console.log("Programming");
}






السؤال الخامس

اكتب برنامجًا كما يلي:

① اطبع "Good morning" على وحدة التحكم 7 مرات
* استخدم اسم المتغيّر i وأعطه في البداية القيمة 0.
* استخدم عامل الزيادة (increment operator).

الاجابة

for ( let i = 0; i < 7; i++){
console.log("Good morning");
}









السؤال السادس

اختر ناتج التنفيذ للبرنامج التالي من الخيارات:

for (let i = 0; i < 3; i++) {
let num = 100;
}
console.log(num);


الاجابة

يؤدي إلى خطأ







السؤال السابع

أضف برنامجًا إلى البرنامج المكتوب بحيث يطبع "End" عندما تكون قيمة المتغيّر i مساوية لـ 4.

الاجابة

مسح او تعديل الكود ليصبح بهذا الشكل

for (let i = 0; i < 5; i++) {
console.log("sit-ups");
if (i == 4) {
console.log("End");
}
}







السؤال الثامن

اختر ناتج التنفيذ للبرنامج التالي من الخيارات:

for (let i = 0; i < 3; i++) {
console.log("A");
if (i == 1) {
console.log("B");
}
}


الاجابة

AABA









السؤال التاسع

الرجاء اختيار البرنامج المعاد كتابته للتعبير عن: i = i + 2.

الاجابة

i += 2



</pre>`
,
23: `<pre dir="rtl">السؤال الاول

ننشئ دالة تقسم البيتزا إلى 6 أجزاء متساوية.

لننشئ البرنامج التالي:
(1) أنشئ دالة بالاسم divide6 ومعامل total
(2) أسند total ÷ 6 إلى المتغير per
(3) أرجع المتغير per
*سندخل البرنامج لاستدعائه في الخطوة التالية.


الاجابة

function divide6(total) {
let per = total / 6;
return per;
}






السؤال الثاني

ننشئ دالة تقسم 72 قطعة بيتزا إلى 6 أجزاء متساوية.
لننشئ البرنامج التالي:
① استدعِ الدالة divide6 بالوسيط 72 وأخرج الناتج إلى وحدة التحكم.

الاجابة

نكتب في المكان المخصص للكود

console.log(divide6(72));

شكل الكود النهائي

function divide6(total) {
let per = total / 6;
return per;
}
console.log(divide6(72));






السؤال الثالث


ننشئ دالة تقسم تكلفة البولينج الكلية على 5 أشخاص.

لننشئ البرنامج التالي:
① أنشئ دالة باسم split5 ومعامل total
② أسند total ÷ 5 إلى المتغير per
③ أرجع قيمة المتغير per
④ استدعِ الدالة split5 بالوسيط 6250 وأخرج الناتج إلى وحدة التحكم


الاجابة

function split5(total) {
let per = total / 5;
return per;
}
console.log(split5(6250));






....................................................................................................................................................


الدرس الثاني


السؤال الاول


اضغط "تشغيل الكود" دون تعديل البرنامج.

نضغط علي تشغيل الكود





سؤال
ماذا نسمّي النطاق الذي تكون فيه المتغيّرات قابلة للاستخدام؟

الاجابة

Scope





سؤال
هل ستؤدي هذه الشيفرة إلى حدوث خطأ؟

function split5(total) {
let result = total / 5;
return result; }
console.log(result);

الاجابة

تؤدي إلى حدوث خطأ






سؤال
هل ستؤدي هذه الشيفرة إلى خطأ؟

function divide6(total) {
let result = total / 6;
return result; }
console.log(divide6(72));

الاجابه

لا تؤدي إلى خطأ






...................................................................................................................................................


الدرس الثالث


السؤال الاول


اضغط "تشغيل الكود" دون تعديل البرنامج.


نضغط علي تشغيل الكود








السؤال الثاني


ننشئ دالة تُخرج "Good morning!".

لننشئ البرنامج التالي:
① أنشئ دالة باسم goodMorning بدون معاملات
② أسند "Good morning!" إلى المتغير greeting
③ أرجع المتغير greeting
④ استدعِ الدالة goodMorning وأخرج الناتج إلى وحدة التحكم


الاجابة

function goodMorning() {
let greeting = "Good morning!";
return greeting;
}
console.log(goodMorning());







..................................................................................................................................................


الدرس الرابع


السؤال الاول

ننشئ دالة تجمع عددين.

لننشئ البرنامج التالي:
(1) أنشئ دالة بالاسم sum وبمعاملين num1 و num2
(2) أسند num1 + num2 إلى المتغير result
(3) أرجع المتغير result
* سندخل البرنامج لاستدعائه في الخطوة التالية.

الاجابة

function sum(num1, num2) {
let result = num1 + num2;
return result;
}






السؤال الثاني

ننشئ دالة تجمع عددين.

لننشئ البرنامج التالي:
① استدعِ الدالة sum بالوسيطين 50 و 100 وأخرج الناتج إلى وحدة التحكم.


الاجابة

نكتب الكود في المكان المخصص

console.log(sum(50, 100));

شكل الكود النهائي

function sum(num1, num2) {
let result = num1 + num2;
return result;
}
console.log(sum(50, 100));








..................................................................................................................................................


مراجعة المستوي 23
حل مراجعة المستوي 23




السؤال الاول


اختر البرنامج الصحيح لإنشاء دالة باسم move بدون معاملات.


الاجابة

function move() {
Program to Run
}






السؤال الثاني

اختر المخرجات الصحيحة عند تنفيذ البرنامج التالي:

function calc(num) {
let result = num + 5;
return result;
}
console.log(calc(50));




الاجابة


55






السؤال الثالث


اختر المخرجات الصحيحة عند تنفيذ البرنامج التالي:

function calc( number ){
let answer = number * 10;
return answer;
}
console.log( calc(3) );



الاجابة

30







السؤال الرابع

تم إنشاء دالة باسم divide5 تقوم بالقسمة على 5، لذا يرجى الإخراج إلى وحدة التحكم بتمرير القيمة 35 إلى الدالة divide5.

الاجابة

تعديل السطر الاخير من الكود ليصبح هكذا

console.log(divide5(35));

شكل الكود بالكامل النهائي

function divide5(total) {
let num = total / 5;
return num;
}
console.log(divide5(35));







السؤال الخامس

اختر نتيجة تنفيذ البرنامج التالي من الخيارات أدناه:

function calc(num) {
let answer = num * 3;
return answer;
}
console.log(answer);

الاجابة

ينتج عنه خطأ







السؤال السادس

أنشئ برنامجًا كما يلي يقوم بإخراج **Good night!** عند استدعاء الدالة goodNight:

① أنشئ دالة باسم goodNight بدون معاملات
② أسند النص "Good night!" إلى المتغير greeting
③ أرجع قيمة المتغير greeting
④ استدعِ الدالة goodNight وقم بالإخراج إلى وحدة التحكم

الاجابة

مسح او تعديل الكود ليصبح هكذا

function goodNight() {
let greeting = "Good night!";
return greeting;
}
console.log(goodNight());







السؤال السابع

يوجد برنامج مكتوب لدالة تقوم بالضرب عند تمرير معاملين.

أدخل برنامجًا يستدعي الدالة mul، ويمرر المعاملين **9** و **7**، ويخرج النتيجة إلى وحدة التحكم.

الاجابة

نكتب في المكان المخصص للكود

console.log(mul(9,7));

شكل الكود النهائي

function mul(num1, num2) {
let answer = num1 * num2;
return answer;
}
console.log(mul(9,7));




</pre>`
,
24: `<pre dir="rtl">السؤال الاول

لِنُنشِئ برنامجًا كما يلي:
(1) اعلن عن المتغيّر score وأسنِد إليه 82
(2) إذا كان المتغيّر score يساوي 100 فاطبع "Perfect Score"
(3) وإلا، إذا كان المتغيّر score أكبر من أو يساوي 75 فاطبع "Pass"
(4) إن لم ينطبق أيٌّ منهما فاطبع "Retest"


الاجابة

let score = 82;
if (score == 100) {
console.log("Perfect Score");
} else if (score >= 75) {
console.log("Pass");
} else {
console.log("Retest");
}







سؤال
هل سينتج عن هذا البرنامج خطأ؟

let contest = 1;
if (contest == 1) {
let prize = 30000;
}
console.log(prize + " codycoins GET");

الاجابة

ينتج عنه خطأ






سؤال
هل سينتج عن هذا البرنامج خطأ؟

for (let i = 0; i < 7; i++) {
console.log(i);
}


الاجابة

لا ينتج عنه خطأ









سؤال
هل سينتج عن هذا البرنامج خطأ؟

function split5(total) {
let result = total / 5;
return result;
}
console.log(result);

الاجابة

ينتج عنه خطأ









السؤال الثاني

سوف ننشئ برنامجًا يطبع "Test Passed" إذا كان score أكبر من أو يساوي 80، ومن بين هؤلاء، إذا كانت قيمة rank هي 1 فسيطبع "Trophy Acquired".

أنشِئ البرنامج كما يلي:
(1) اعلن عن المتغيّر score وأسنِد إليه 90
(2) اعلن عن المتغيّر rank وأسنِد إليه 1
(3) إذا كان المتغيّر score أكبر من أو يساوي 80 فاطبع "Test Passed" إلى وحدة التحكم
(4) إذا كان المتغيّر rank يساوي 1 فاطبع "Trophy Acquired"
* على أن لا تستخدم AND (&&)

الاجابة

let score = 90;
let rank = 1;
if (score >= 80) {
console.log("Test Passed");
if (rank == 1) {
console.log("Trophy Acquired");
}
}






السؤال الثالث

سننشئ برنامجًا يطبع "Apple, Apple, Banana, Apple".
أنشِئ البرنامج كما يلي:
① استخدم حلقة for لطباعة "Apple" إلى وحدة التحكم 3 مرات
　* أعلن عن المتغيّر باسم i
② عند طباعة "Apple" للمرة الثانية، اطبع "Banana" إلى وحدة التحكم


الاجابة

for (let i = 0; i < 3; i++) {
console.log("Apple");
if (i == 1) {
console.log("Banana");
}
}






السؤال الرابع

سننشئ دالة تطبع "Good night!".
أنشِئ البرنامج كما يلي:
① أنشِئ دالة بالاسم goodNight وبدون معاملات
② أَسنِد "Good night!" إلى المتغيّر greeting
③ أَعِد المتغيّر greeting
④ استدعِ الدالة goodNight واطبع إلى وحدة التحكم

الاجابة

function goodNight(){
let greeting = "Good night!";
return greeting;
}
console.log(goodNight());








السؤال الخامس

سننشئ دالة تضرب رقمين.
أنشِئ البرنامج كما يلي:
① أنشِئ دالة بالاسم calc وبمعاملين num1 و num2
② أَسنِد ناتج num1 × num2 إلى المتغيّر result
③ أَعِد المتغيّر result
④ استدعِ الدالة calc بالوسيطين 55 و 75 واطبع إلى وحدة التحكم

الاجابة

function calc(num1, num2) {
let result = num1 * num2;
return result;
}
console.log(calc(55, 75));







.................................................................................................................................................

حل مراجعة المستوي 24

اجابة اختبار منتصف الطريق المستوي 24




السؤال الاول

أضِف شرطًا ثانيًا إلى البرنامج المكتوب:
إذا كان A أصغر من B، فاطبع في وحدة التحكم ‘B is larger’.
سيُكتب الشرط الثاني على النحو ‘A < B’.

الاجابة

امسح او عدل الكود ليكون هكذا

let A = 5
let B = 10
if (A > B) {
console.log("A is larger");
} else if (A < B) {
console.log("B is larger");
}









السؤال الثاني

يرجى اختيار المعامل الصحيح الذي يمثّل "تحقُّق عدّة شروط في الوقت نفسه" (AND).

الاجابة

&&









السؤال الثالث

أنشئ برنامجًا يطبع ‘Science is 100 points’ إذا كانت درجة Science هي 100 نقطة، ومن بين تلك الحالات، إذا كانت درجة Math أيضًا 100 نقطة، فليطبع ‘Science and Math are 100 points’ إلى وحدة التحكم.
على أن لا تستخدم ‘&&’ التي تعني AND.

الاجابة

امسح او عدل الكود ليكون هكذا

let science = 100;
let math = 100;
if (science == 100) {
console.log("Science is 100 points");
if (math == 100) {
console.log("Science and Math are 100 points");
}
}








السؤال الرابع

أنشئ برنامجًا كما يلي:

① اطبع ‘Good morning’ في وحدة التحكم 7 مرات
* استخدم اسم المتغيّر ‘i’ واجعل قيمته الابتدائية 0.
* استخدم معامل الزيادة.

الاجابة

for (let i=0 ; i < 7 ; i++){
console.log("Good morning");
}









السؤال الخامس

اختر نتيجة تنفيذ البرنامج التالي من الخيارات:

for (let i = 0; i < 3; i++) {
let num = 100;
}
console.log(num);


الاجابة

ينتج عنه خطأ









السؤال السادس

اختر نتيجة تنفيذ البرنامج التالي من الخيارات:


for (let i = 0; i < 4; i++) {
console.log("0");
if (i == 2) {
console.log("1");
}
}

الاجابة

00010







السؤال السابع

يرجى اختيار إعادة كتابة البرنامج لـ "i = i + 5".

الاجابة

i += 5










السؤال الثامن

تم إنشاء دالة "divide3" التي تقسم على 3، لذا رجاءً اطبع إلى وحدة التحكم بتمرير القيمة "12345" إلى divide3

الاجابة

مسح او تعديل الكود ليصبح هكذا

function divide3(num) {
let result = num / 3;
return result;
}
console.log(divide3(12345));










السؤال التاسع

يرجى اختيار البرنامج الصحيح لإنشاء دالة move بلا معاملات.

الاجابة
function move() {
Program to Run
}










السؤال العاشر

أنشئ دالة mul بوسيطين.
① أنشئ دالة بالاسم "mul" وبالمعاملين "num1" و"num2"
② أسند "num1 × num2" إلى المتغيّر "result"
③ أعد المتغيّر "result"
④ استدعِ الدالة mul بالوسيطين "9" و"7" واطبع إلى وحدة التحكم

الاجابة

function mul(num1,num2) {
let result = num1 * num2;
return result;
}
console.log(mul(9,7));








</pre>`
,
25: `<pre dir="rtl">الدرس الاول

سؤال
عندما تحتاج إلى “تكرار" عملية الضرب… أي نوع من البرامج يجب أن تستخدم؟

الاجابة
حلقة for


السؤال الاول


اضغط على "تشغيل الكود" بدون تعديل البرنامج.
نضغط علي تشغيل الكود فقط





السؤال الثاني

اضغط على "تشغيل الكود" بدون تعديل البرنامج.
نضغط علي تشغيل الكود فقط





السؤال الثالث

اضغط على "تشغيل الكود" بدون تعديل البرنامج.
نضغط علي تشغيل الكود فقط



..............................................................................................................................................


الدرس الثاني


السؤال الاول

سننشئ برنامجًا يحسب ‎2×2×2×2×2‎.

لنُدخل نفس البرنامج كما يلي:
let num = 1;
for(let i = 0; i < 5; i++){
num = num * 2;
}
console.log(num);


الاجابة

let num = 1;
for (let i = 0; i < 5; i++) {
num = num * 2;
}
console.log(num);







السؤال الثاني

سننشئ برنامجًا يحسب ‎4×4×4×4‎.

لننشئ برنامجًا كما يلي:
(1) صرّح عن متغير num وأعطه القيمة ‎1‎
(2) كرر العملية ‎num = num * 4‎ أربع مرات
(3) أخرج قيمة المتغير num إلى وحدة التحكم

الاجابة

let num = 1;
for (let i = 0; i < 4; i++) {
num = num * 4;
}
console.log(num);








السؤال الثالث

سننشئ برنامجًا يحسب ‎4×4×4×4‎.

أدخل نفس البرنامج كما يلي:
for (let i = 1; i <= 4; i++) {
num = num * 4;
}


الاجابة

نكتب في المكان المخصص لكتابة الكود

let i = 1; i <= 4; i++

شكل الكود النهائي


let num = 1;
for (let i = 1; i <= 4; i++) {
num = num * 4;
}
console.log(num);



....................................................................................................................................................


الدرس الثالث


السؤال الاول

اضغط على "تشغيل الكود" بدون تعديل البرنامج.
نضغط علي تشغيل الكود فقط





السؤال الثاني

سننشئ برنامجًا يحسب ‎1×2×3×4‎.

أدخل نفس البرنامج كما يلي:
let num = 1;
for (let i = 1; i <= 5; i++) {
num = num * i;
}
console.log(num);

الاجابة

let num = 1;
for (let i = 1; i <= 5; i++) {
num = num * i;
}
console.log(num);







السؤال الثالث

سننشئ برنامجًا يحسب ‎1×2×3×4×5×6×7×8×9×10‎.

لننشئ برنامجًا كما يلي:
(1) صرّح عن متغير num وأعطه القيمة ‎1‎
(2) كرر عملية إسناد الحساب ‎num * i‎ إلى المتغير num عشر مرات
* أعط القيمة ‎1‎ للمتغير i، واجعل الشرط أنه إذا كان i أقل من أو يساوي ‎10‎، يزداد i بمقدار ‎1‎
(3) أخرج قيمة المتغير num إلى وحدة التحكم

الاجابة

let num = 1;
for (let i = 1; i <= 10; i++) {
num = num * i;
}
console.log(num);



....................................................................................................................................................


مراجعة المستوي 25
حل مراجعة المستوي 25


السؤال الاول

الرجاء اختيار نتيجة تنفيذ البرنامج التالي من الخيارات.

let num = 1;
for (let i = 0; i < 3; i++) {
num = num * 2;
}
console.log(num);

الاجابة

8






السؤال الثاني

سننشئ برنامجًا يحسب ‘7×7×7×7×7’.

لننشئ البرنامج كما يلي:
① صرّح عن المتغيّر num وأسنِد له القيمة 1
② كرّر العملية num = num * 7 خمس مرات
* أسند 0 للمتغيّر i، وضع الشرط بحيث إذا كان i أصغر من 5 يزداد بمقدار 1
③ اطبع قيمة المتغيّر num إلى وحدة التحكم مرة واحدة فقط في النهاية

الاجابة

let num = 1;
for(let i = 0; i < 5; i++){
num = num * 7;
}
console.log(num);







السؤال الثالث

من بين الخيارات، اختر التمثيل الأنسب لكيفية تغيّر قيمة المتغيّر i في البرنامج التالي.

let num = 1; for(
let i = 1; i <= 7; i++){
num = num * 2;
}
console.log(num);

الاجابة

1→2→3→4→5→6→7








السؤال الرابع

سننشئ برنامجًا يحسب ‘0+1+2+3+4+5’.

لننشئ البرنامج كما يلي:
① صرّح عن المتغيّر num وأسنِد له القيمة 0
② كرّر العملية إسناد نتيجة (num + i) إلى المتغيّر num ست مرات
* أسند 0 للمتغيّر i، وضع الشرط بحيث إذا كان i أصغر من 6 يزداد بمقدار 1
③ اطبع قيمة المتغيّر num إلى وحدة التحكم مرة واحدة فقط في النهاية


الاجابة

let num = 0;
for (let i = 0; i < 6; i++) {
num = num + i;
}
console.log(num);






السؤال الخامس

سننشئ برنامجًا يحسب ‘5040÷1÷2÷3÷4÷5’.

لننشئ البرنامج كما يلي:
① صرّح عن المتغيّر num وأسنِد له القيمة 5040
② كرّر العملية إسناد نتيجة (num / i) إلى المتغيّر num خمس مرات
* للشرط في الحلقة، أسند 1 للمتغيّر i، وضع الشرط بحيث إذا كان i أصغر من أو يساوي 5 يزداد بمقدار 1
③ اطبع قيمة المتغيّر num إلى وحدة التحكم مرة واحدة فقط في النهاية


الاجابة

let num = 5040;
for(let i = 1; i <= 5; i++){
num = num / i;
}
console.log(num);








</pre>`
,
26: `<pre dir="rtl">الدرس الاول

سؤال

ما اسم البرنامج الذي يمكنه تجميع عدة قيم معًا؟

الاجابة

مصفوفة (Array)





السؤال الاول

سننشئ برنامجًا يُسند بيانات درجة الحرارة إلى المتغيّر tempList.
درجات الحرارة هي 36.2، 36.5، 36.3، 36.8، و36.4.

أدخل نفس البرنامج كما يلي:
let tempList = [36.2, 36.5, 36.3, 36.8, 36.4];

الاجابة

let tempList = [36.2, 36.5, 36.3, 36.8, 36.4];








سؤال

عند تنفيذ هذا البرنامج، ما الناتج؟
let tempList = [36.2, 36.5, 36.3, 36.8, 36.4];
console.log(tempList[2]);

الاجابة

36.3





السؤال الثاني

سننشئ برنامجًا يخرج القيمة الثانية من المتغيّر tempList إلى وحدة التحكم (console).

أدخل نفس البرنامج كما يلي:
let tempList = [36.2, 36.5, 36.3, 36.8, 36.4];
console.log(tempList[2]);


الاجابة

نضيف الكود التالي في السطر الثاني

console.log(tempList[2]);


الكود النهائي

let tempList = [36.2, 36.5, 36.3, 36.8, 36.4];
console.log(tempList[2]);









السؤال الثالث

سننشئ برنامجًا يخرج القيمة **36.8** من المتغيّر tempList إلى وحدة التحكم.

لننشئ البرنامج كما يلي:
① اجلب القيمة "36.8" من المتغيّر tempList وأخرجها إلى وحدة التحكم
* من فضلك لا تُدخل "36.8" مباشرة.

الاجابة

نضيف الكود التالي في السطر الثاني

console.log(tempList[3]);

الكود النهائي

let tempList = [36.2, 36.5, 36.3, 36.8, 36.4];
console.log(tempList[3]);


................................................................................................................................................


الدرس الثاني

السؤال الاول

سوف ننشئ برنامجًا يُسند بيانات درجات الحرارة إلى المتغيّر tempList.
درجات الحرارة هي 36.2 درجة، 36.5 درجة، 36.3 درجة، 36.8 درجة، 36.4 درجة، 36.9 درجة، و37.0 درجة.

لنُنشئ البرنامج كما يلي:
① إسناد قيم درجات الحرارة إلى المتغيّر tempList

الاجابة

let tempList = [36.2, 36.5, 36.3, 36.8, 36.4, 36.9, 37.0];






السؤال الثاني

سننشئ برنامجًا لعرض متوسط درجة حرارة الجسم خلال 7 أيام.

ابتداءً من السطر الثاني، لننشئ البرنامج كما يلي:
(1) إعلان المتغيّر sum وإسناد القيمة 0 إليه
(2) تكرار العملية sum = sum + tempList[i] سبع مرات
* استخدم المتغيّر i
(3) إخراج قيمة sum ÷ عدد الأيام في وحدة التحكم (console)

الاجابة

كتابة الكود التالي من السطر الثاني الي السادس

let sum = 0;
for(let i = 0; i < 7; i++){
sum = sum + tempList[i];
}
console.log(sum / 7);



شكل الكود النهائي

let tempList = [36.2, 36.5, 36.3, 36.8, 36.4, 36.9, 37.0];
let sum = 0;
for(let i = 0; i < 7; i++){
sum = sum + tempList[i];
}
console.log(sum / 7);







سؤال ترفيهي
ما هي درجة حرارة جسم كودي؟

خمن اي اختيار من الثلاث لا مشكلة


...............................................................................................................................................


الدرس الثالث

السؤال الاول

لننشئ برنامجًا يعرض عدد القيم الموجودة في المصفوفة.

اكتب البرنامج كما يلي:
console.log(tempList.length);

الاجابة

نكتب الكود التالي في سطر جديد ونترك الكود المكتوب كما هو

console.log(tempList.length);

شكل الكود النهائي

let tempList = [36.0, 36.5, 36.3, 36.8, 36.4, 36.9, 36.6, 37.0, 37.1, 36.9, 36.4, 36.6, 36.7, 36.5];
console.log(tempList.length);







السؤال الثاني

سننشئ برنامجًا يعرض متوسط درجة حرارة الجسم خلال ١٤ يومًا من البيانات المخزنة في المتغيّر tempList.

أدخل البرنامج كما يلي:
let sum = 0;
for (let i = 0; i < 14; i++) {
sum = sum + tempList[i];
}
console.log(sum / 14);


الاجابة

نكتب في الاماكن المخصصة لكتابة الكود

14


14


شكل الكود النهائي

let tempList = [36.0, 36.5, 36.3, 36.8, 36.4, 36.9, 36.6, 37.0, 37.1, 36.9, 36.4, 36.6, 36.7, 36.5];
let sum = 0;
for (let i = 0; i < 14; i++) {
sum = sum + tempList[i];
}
console.log(sum / 14);









السؤال الثالث

سننشئ برنامجًا يعرض متوسط درجة حرارة الجسم خلال ١٤ يومًا من البيانات في المتغيّر tempList.

أدخل البرنامج كما يلي:
for(let i = 0; i < tempList.length; i++){
sum = sum + tempList[i];
}
console.log(sum / tempList.length);


الاجابة

نكتب في الاماكن المخصصة لكتابة الكود

let i = 0; i < tempList.length; i++


tempList.length



شكل الكود النهائي


let tempList = [36.0, 36.5, 36.3, 36.8, 36.4, 36.9, 36.6, 37.0, 37.1, 36.9, 36.4, 36.6, 36.7, 36.5];
let sum = 0;
for(let i = 0; i < tempList.length; i++ ){
sum = sum + tempList[i];
}
console.log(sum / tempList.length );


..................................................................................................................................................


الدرس الرابع

السؤال الاول

سننشئ برنامجًا يعرض "Be careful!" إذا كانت هناك درجة حرارة ٣٧.٠°م أو أعلى ضمن بيانات درجات الحرارة.

لننشئ البرنامج كما يلي:
(1) حلقة تكرار for تتكرر بعدد القيم في المتغيّر tempList
(2) داخل الحلقة، إذا كانت القيمة رقم i من tempList أكبر من أو تساوي ٣٧.٠، اعرض على وحدة التحكم:

الاجابة

نترك الكود المكتوب كما هو ونكمل من سطر جديد


for (let i = 0; i < tempList.length; i++) {
if (tempList[i] >= 37.0) {
console.log("Be careful!");
}
}


شكل الكود الكامل النهائي


let tempList = [36.0, 36.5, 36.3, 36.8, 36.4, 36.9, 36.6, 37.0, 37.1, 36.9, 36.4, 36.6, 36.7, 36.5];
for (let i = 0; i < tempList.length; i++) {
if (tempList[i] >= 37.0) {
console.log("Be careful!");
}
}









السؤال الثاني

سننشئ برنامجًا يعرض "Avoid going outside!" إذا وُجدت درجة حرارة 37.5°C أو أعلى ضمن بيانات درجات الحرارة.

لننشئ البرنامج كما يلي:
(1) أنشئ حلقة تكرار (for loop) تتكرر بعدد القيم في المتغيّر (variable tempList)
(2) داخل عملية التكرار في (1)، إذا كانت القيمة رقم (i-th value) من المتغيّر (variable tempList) أكبر من أو تساوي 37.5، اعرض على وحدة التحكم "Avoid going outside!"

الاجابة


مسح او تعديل الكود ليصبح هكذا

let tempList = [36.0, 36.5, 36.3, 36.8, 36.4, 36.9, 36.6, 37.0, 37.1, 36.9, 36.4, 36.6, 36.7, 36.5];
for (let i = 0; i < tempList.length; i++) {
if (tempList[i] >= 37.5) {
console.log("Avoid going outside!");
}
}






...................................................................................................................................................


مراجعة المستوي 26
حل مراجعة المستوي 26


السؤال الاول

اختر نتيجة الإخراج عند تنفيذ البرنامج التالي:

let scoreList = [52, 60, 79, 82, 66, 59, 88];
console.log(scoreList[2]);


الاجابة

79






السؤال الثاني


اكتب برنامجًا يُخرج القيمة "59" من المتغيّر scoreList إلى وحدة التحكم (console).
ولكن، يُرجى عدم إدخال "59" مباشرةً.


الاجابة


نكتب في السطر الثاني الكود التالي


console.log(scoreList[5]);


الكود كامل


let scoreList = [52, 60, 79, 82, 66, 59, 88];
console.log(scoreList[5]);










السؤال الثالث


اكتب برنامجًا يُخرج متوسط الدرجات لعدد 7 أشخاص.

ابتداءً من السطر الثاني، أنشئ البرنامج كما يلي:
1. أعلن عن متغيّر باسم sum وأسنِد له القيمة 0.
2. كرّر العملية sum = sum + scoreList[i] سبع مرات.
 لكن استخدم المتغيّر i، ويُرجى عدم استخدام length هنا.
3. أخرِج إلى وحدة التحكم (console) قيمة المتغيّر sum مقسومة على عدد الأشخاص (7).


الاجابة


نكتب الكود التالي من السطر الثاني

let sum = 0;
for(let i = 0; i < 7; i++){
sum = sum + scoreList[i];
}
console.log(sum / 7);


الكود كامل


let scoreList = [52, 60, 79, 82, 66, 59, 88];
let sum = 0;
for(let i = 0; i < 7; i++){
sum = sum + scoreList[i];
}
console.log(sum / 7);








السؤال الرابع

اكتب برنامجًا يُخرج عدد القيم الموجودة في المتغيّر scoreList إلى وحدة التحكم (console).

الاجابة


كتابه الكود التالي في السطر الثاني


console.log(scoreList.length);


الكود كامل


let scoreList = [52, 60, 79, 82, 66, 59, 88];
console.log(scoreList.length);









السؤال الخامس

سننشئ برنامجًا يُخرج العبارة "80 points or higher" إذا كانت الدرجة 80 أو أكثر.

أنشئ البرنامج كما يلي:
1. استخدم حلقة for تتكرّر بعدد القيم الموجودة في المتغيّر scoreList.
2. داخل عملية التكرار، إذا كانت القيمة i في المتغيّر scoreList أكبر من أو تساوي 80، أخرِج إلى وحدة التحكم (console) العبارة "80 points or higher".


الاجابة

كتابة الكود التالي من السطر الثاني الي السادس


for (let i = 0; i < scoreList.length; i++) {
if (scoreList[i] >= 80) {
console.log("80 points or higher");
}
}


الكود كامل

let scoreList = [52, 60, 79, 82, 66, 59, 88];
for (let i = 0; i < scoreList.length; i++) {
if (scoreList[i] >= 80) {
console.log("80 points or higher");
}
}




</pre>`
,
27: `<pre dir="rtl">[الدرس1]مراجعة الفصلين 25 و26



السؤال الاول

سننشئ برنامجًا يحسب ‎7×7×7×7×7×7×7‎.

لننشئ البرنامج كما يلي:
1. صرّح عن المتغيّر ‎num‎ وأسنِد إليه القيمة ‎1‎
2. كرّر العملية ‎num = num * 7‎ عدد ‎7‎ مرات
* اسنِد ‎0‎ إلى المتغيّر ‎i‎، واجعل الشرط بحيث إذا كان ‎i‎ أقل من ‎7‎ فقم بزيادة ‎i‎
3. اطبع قيمة المتغيّر ‎num‎ إلى وحدة التحكم (الكونسول)


الاجابة

let num = 1;
for (let i = 0; i < 7; i++) {
num = num * 7;
}
console.log(num);








السؤال الثاني

سننشئ برنامجًا يحسب ‎1×2×3×4×5‎.

أدخل البرنامج كما يلي:

let num = 1;
for (let i = 1; i <= 5; i++) {
num = num * i;
}
console.log(num);


الاجابة


let num = 1;
for (let i = 1; i <= 5; i++) {
num = num * i;
}
console.log(num);










السؤال الثالث


سننشئ برنامجًا يضرب الأعداد من ‎1‎ إلى ‎15‎ على التوالي.

لننشئ البرنامج كما يلي:
1. صرّح عن المتغيّر ‎num‎ وأسنِد إليه القيمة ‎1‎
2. كرّر إسناد العملية ‎num * i‎ إلى المتغيّر ‎num‎ عدد ‎15‎ مرة
* اسنِد ‎1‎ إلى المتغيّر ‎i‎، واجعل الشرط بحيث إذا كان ‎i‎ أقل من أو يساوي ‎15‎ فقم بزيادة ‎i‎
3. اطبع قيمة المتغيّر ‎num‎ إلى وحدة التحكم


الاجابة

let num = 1;
for (let i = 1; i <= 15; i++) {
num = num * i;
}
console.log(num);








سؤال

ما النتيجة التي ستظهر عند تنفيذ هذا البرنامج؟
let tempList = [36.2, 36.5, 36.3, 36.8, 36.4];
console.log(tempList[3]);


الاجابة

36.8












السؤال الرابع

سننشئ برنامجًا يطبع القيمة ‎36.4‎ من المتغيّر ‎tempList‎ إلى وحدة التحكم.

لننشئ البرنامج كما يلي:
1. استخرج القيمة ‎36.4‎ من المتغيّر ‎tempList‎ وأخرجها إلى وحدة التحكم
ى يُرجى عدم إدخال ‎36.4‎ مباشرة.


الاجابة

كتابة الكود التالي في السطر الثاني

console.log(tempList[4]);


الكود كامل

let tempList = [36.0, 36.5, 36.3, 36.8, 36.4];
console.log(tempList[4]);










السؤال الخامس

سننشئ برنامجًا يطبع متوسّط درجة الحرارة من بيانات درجات الحرارة في المتغيّر ‎tempList‎.

لعدد مرات التكرار في الجمع، وكذلك لعدد الأيام المقسوم عليها في النهاية،
لنُدخل ‎variableName.length‎.

الاجابة

كتابة الاكواد التالية في الاماكن المخصصة للكتابة


tempList.length


tempList.length



شكل الكود الكامل

let tempList = [36.0, 36.5, 36.3, 36.8, 36.4, 36.9, 36.6, 37.0, 37.1, 36.9, 36.4, 36.6, 36.7, 36.5];
let sum = 0;
for(let i = 0; i < tempList.length; i++){
sum = sum + tempList[i];
}
console.log(sum / tempList.length);










السؤال السادس

سننشئ برنامجًا يطبع «لنكن حذرين!» إذا وُجدت درجة حرارة ‎37.0°C‎ أو أعلى بين بيانات درجات الحرارة.

لننشئ البرنامج كما يلي:
(1) حلقة ‎for‎ تتكرّر بعدد القيم في المتغيّر ‎tempList‎
* اسنِد ‎0‎ إلى المتغيّر ‎i‎.
(2) كعملية متكرّرة في (1)، إذا كانت القيمة ذات الترتيب ‎i‎ في المتغيّر ‎tempList‎ أكبر من أو تساوي ‎37.0°C‎، فاطبع «لنكن حذرين!» إلى وحدة التحكم


الاجابة

نترك الكود المكتوب ونكمل من سطر جديد بالكود التالي

for (let i = 0; i < tempList.length; i++) {
if (tempList[i] >= 37.0) {
console.log("Be careful!");
}
}



الكود الكامل

let tempList = [36.0, 36.5, 36.3, 36.8, 36.4, 36.9, 36.6, 37.0, 37.1, 36.9, 36.4, 36.6, 36.7, 36.5];
for (let i = 0; i < tempList.length; i++) {
if (tempList[i] >= 37.0) {
console.log("Be careful!");
}
}






...............................................................................................................................................


مراجعة الفهم المستوي 27
حل مراجعة الفهم المستوي 27


السؤال الاول


سننشئ برنامجًا يحسب '9×9×9'.
لِنُنشئ برنامجًا كما يلي:
① صرّح عن المتغيّر num وأسنِد إليه القيمة 1
② كرّر العملية الحسابية 'num = num * 9' ثلاث مرات
*أسنِد 0 إلى المتغيّر i، وعيّن الشرط بحيث إذا كان i أصغر من 3، قم بزيادة i.
③ اطبع قيمة المتغيّر num على وحدة التحكم مرة واحدة فقط في النهاية


الاجابة

let num = 1;
for (let i = 0; i < 3; i++) {
num = num * 9;
}
console.log(num);












السؤال الثاني

من بين الخيارات، حدد التمثيل الأنسب لكيفية تغيّر قيمة المتغيّر i في البرنامج التالي.

let num = 1;
for (let i = 1; i <= 4; i++) {
num = num * 2;
}
console.log(num);


الاجابة

1→2→3→4










السؤال الثالث

سننشئ برنامجًا يحسب '5040÷1÷2÷3÷4÷5'.

لِنُنشئ برنامجًا كما يلي:
① صرّح عن المتغيّر num وأسنِد إليه القيمة 5040
② كرّر 'إسناد العملية الحسابية num / i إلى المتغيّر num' خمس مرات
ولكن، بالنسبة لشرط الحلقة، أسنِد 1 إلى المتغيّر i، وعيّن الشرط بحيث إذا كان i أصغر من أو يساوي 5، قم بزيادة i.
③ اطبع قيمة المتغيّر num على وحدة التحكم مرة واحدة فقط في النهاية


الاجابة

let num = 5040;
for (let i = 1; i <= 5; i++) {
num = num / i;
}
console.log(num);













السؤال الرابع

أنشئ برنامجًا يجلب '63' من المتغيّر scoreList ويطبعه على وحدة التحكم.
ولكن، يرجى عدم إدخال '63' مباشرةً.

الاجابة

نكتب في المكان المخصص لكتابة الكود

scoreList[4]


الكود كامل

let scoreList = [52, 90, 70, 83, 63, 72, 89];
console.log(scoreList[4]);











السؤال الخامس

أدخل برنامجًا يطبع عدد القيم في المتغيّر scoreList على وحدة التحكم.

الاجابة

نكتب في المكان المخصص الكود التالي

scoreList.length


الكود الكامل

let scoreList = [52, 90, 70, 83, 63, 72, 89];
console.log(scoreList.length);













السؤال السادس

سننشئ برنامجًا يطبع 'Pass' إذا كانت الدرجة 80 أو أعلى.

أنشئ برنامجًا كما يلي:
① حلقة for تكرارية تتكرر لعدد القيم في المتغيّر scoreList
② كعملية متكررة في ①، إذا كانت القيمة i للمتغيّر scoreList أكبر من أو تساوي 80، اطبع 'Pass' على وحدة التحكم


الاجابة

نكتب من السطر الثاني الكود التالي

for (let i = 0; i < scoreList.length; i++) {
if (scoreList[i] >= 80) {
console.log("Pass");
}
}


الكود كامل

let scoreList = [52, 90, 70, 83, 63, 72, 89];
for (let i = 0; i < scoreList.length; i++) {
if (scoreList[i] >= 80) {
console.log("Pass");
}
}




</pre>`
,
28: `<pre dir="rtl">السؤال الاول

لِنُضِف درجات الحرارة لهذا الأسبوع إلى مصفوفة ونطبع القيمة الرابعة في المصفوفة.
درجات الحرارة لهذا الأسبوع: 2 درجة، 1 درجة، 2 درجة، 1 درجة، 0 درجة، 1 درجة، 1 درجة

(1) أضِف درجات حرارة الأسبوع إلى مصفوفة وأسنِدها إلى المتغيّر degreeList
　*يرجى إدخال قيم درجات الحرارة فقط في المصفوفة
(2) اطبع القيمة الرابعة للمتغيّر degreeList
ولكن، يرجى عدم إدخال قيمة درجة الحرارة مباشرةً


الاجابة

let degreeList = [2, 1, 2, 1, 0, 1, 1];
console.log(degreeList[4]);








سؤال

فيما تُستخدم حلقات for التكرارية؟

الاجابة

تكرار الأشياء








السؤال الثاني

لِنُنشئ برنامجًا يطبع جميع قيم المتغيّر degreeList بالترتيب.

من السطر 2، أدخل البرنامج كما يلي:
for (let i = 0; i < 7; i++) {
console.log(degreeList[i]);
}



الاجابة

ترك الكود المكتوب وكتابة الكود التالي من السطر الثاني الي الرابع


for (let i = 0; i < 7; i++) {
console.log(degreeList[i]);
}




الكود الكامل

let degreeList = [2, 1, 2, 1, 0, 1, 1];
for (let i = 0; i < 7; i++) {
console.log(degreeList[i]);
}












السؤال الثالث

لِنُنشئ برنامجًا يطبع جميع قيم المتغيّر degreeList بالترتيب.

أدخل البرنامج كما يلي:
for (let i = 0; i < degreeList.length; i++) {
console.log(degreeList[i]);
}


الاجابة

كتابة الكود في المكان المخصص لكتابة الكود

degreeList.length

ليكون شكل الكود بالكامل

let degreeList = [2, 1, 2, 1, 0, 1, 1];
for (let i = 0; i < degreeList.length; i++) {
console.log(degreeList[i]);
}





........................................................................................................................................


الدرس الثاني

السؤال الاول

تحقق من البرنامج وانقر على "تشغيل الكود".

اضغط علي تشغيل الكود فقط








السؤال الثاني

سننشئ برنامجًا يعرض جميع قيم درجات الحرارة السبعة على وحدة التحكم.

لِنكتب البرنامج كما يلي:
for (let degree of degreeList) {
console.log(degree);
}


الاجابة

نترك الكود المكتوب ونكتب من السطر الثاني الكود التالي

for (let degree of degreeList) {
console.log(degree);
}


شكل الكود بالكامل

let degreeList = [8, 6, 11, 10, 9, 7, 12];
for (let degree of degreeList) {
console.log(degree);
}






.................................................................................................................................................


الدرس الثالث

السؤال الاول

سننشئ برنامجًا يطبع جميع قيم المتغيّر numList على وحدة التحكم.

استخدم for...of لطباعة جميع قيم المتغيّر numList.
ولكن، يجب أن يكون المتغيّر الذي تسند إليه القيم المجتلبة من المتغيّر numList هو num.


الاجابة

نترك الكود الموجود ونكتب من الشطر الثاني الكود التالي

for (let num of numList) {
console.log(num);
}


ليكون شكل الكود بالكامل

let numList = [5, 10, 15, 20];
for (let num of numList) {
console.log(num);
}








السؤال الثاني

سننشئ برنامجًا يطبع جميع قيم المتغيّر wordList على وحدة التحكم.
السلاسل النصية التي ستضاف إلى wordList: apple، banana، orange

استخدم for...of لطباعة جميع قيم المتغيّر wordList.
ولكن، يجب أن يكون المتغيّر الذي تسند إليه القيم المجتلبة من المتغيّر wordList هو word.


الاجابة

let wordList = ["apple", "banana", "orange"];
for (let word of wordList) {
console.log(word);
}






..................................................................................................................................................


مراجعة المستوي 28
حل مراجعة المستوي 28


السؤال الاول

يرجى تحديد نتيجة تنفيذ البرنامج التالي.

let numList = [8, 6, 11, 10, 9, 7, 12];
console.log(numList[2]);


الاجابة

11










السؤال الثاني

يرجى تحديد نتيجة تنفيذ البرنامج التالي.

let numList = [10, 11, 12];
for (let i = 0; i < 3; i++) {
console.log(numList[i]);
}


الاجابة

10
11
12










السؤال الثالث

يرجى تحديد نتيجة تنفيذ البرنامج التالي.

let numList = [5, 6, 7];
for (let i = 0; i < numList.length; i++) {
console.log(numList[i]);
}


الاجابة

5
6
7











السؤال الرابع

سننشئ برنامجًا يطبع جميع قيم المتغيّر numList على وحدة التحكم.

أنشئ برنامجًا كما يلي:
① استخدم for...of لطباعة جميع قيم المتغيّر numList
ولكن، يجب أن يكون المتغيّر الذي تسند إليه القيم المجتلبة من المتغيّر numList هو num.

الاجابة

نكتب من السطر الثانى الكود التالي

for (let num of numList) {
console.log(num);
}


الكود كامل

let numList = [2, 4, 6, 8];
for (let num of numList) {
console.log(num);
}












السؤال الخامس

سننشئ برنامجًا يطبع جميع قيم المتغيّر wordList على وحدة التحكم.
نحن نضيف سلاسل نصية إلى wordList.

استخدم for...of لطباعة جميع قيم المتغيّر wordList
ولكن، يجب أن يكون المتغيّر الذي تسند إليه القيم المجتلبة من المتغيّر wordList هو word.

الاجابة

نكتب من السطر الثاني الكود التالي

for (let word of wordList) {
console.log(word);
}



الكود كامل

let wordList = ["Good morning", "Good night", "Hello"];
for (let word of wordList) {
console.log(word);
}


</pre>`
,
29: `<pre dir="rtl">السؤال الاول

لِنُنشئ برنامجًا كما يلي:

(1) صرّح عن المتغيّر score وأسنِد إليه القيمة 100
(2) إذا كان score يساوي 100، اطبع "Reward is steak" على وحدة التحكم

الاجابة

let score = 100;
if (score == 100) {
console.log("Reward is steak");
}









السؤال الثاني

سننشئ برنامجًا يطبع "Reward is steak" إذا كانت درجة الاختبار 100، و "Reward is cake" إذا كانت 80 أو أعلى.
تم تعيين درجة الاختبار على "85" نقطة.

من السطر 4 فصاعدًا، لِنُنشئ برنامجًا كما يلي:
(1) كشرط ثانٍ، إذا كان المتغيّر score أكبر من أو يساوي 80، اطبع "Reward is cake"


الاجابة

كتابه الكود التالي من السطر الرابع بعد القوس الي السادس

else if (score >= 80) {
console.log("Reward is cake");
}


الكود الكامل

let score = 85;
if (score == 100) {
console.log("Reward is steak");
} else if (score >= 80) {
console.log("Reward is cake");
}









السؤال الثالث

سننشئ برنامجًا يطبع "Reward is steak" إذا كانت درجة الاختبار 100، و "Reward is cake" إذا كانت 80 أو أعلى، و "No games for a week" في الحالات الأخرى.
درجة الاختبار هي 62 نقطة.

من السطر 6 فصاعدًا، لِنُنشئ برنامجًا كما يلي:
① إذا لم يتحقق أي من الشرطين، اطبع "No games for a week"


الاجابة

كتابه الكود التالي من السطر السادس بعد القوس الي الثامن

else {
console.log("No games for a week");
}


الكود الكامل

let score = 62;
if (score == 100) {
console.log("Reward is steak");
} else if (score >= 80) {
console.log("Reward is cake");
} else {
console.log("No games for a week");
}



............................................................................................................................................


الدرس الثاني

السؤال الاول

سننشئ برنامجًا يطبع "Big catch!" إذا كان حجم السمكة المصطادة 50 سم أو أكبر.

(1) صرّح عن المتغيّر fish وأسنِد إليه القيمة 50
(2) إذا كان fish أكبر من أو يساوي 50، اطبع "!Big catch" على وحدة التحكم


الاجابة

let fish = 50;
if (fish >= 50) {
console.log("Big catch!");
}










السؤال الثاني

سننشئ برنامجًا يطبع "Big catch" وعدد الأسماك الكبيرة المصطادة كـ "Big fish counter" إذا كان حجم السمكة المصطادة 50 سم أو أكبر.

أدخل برنامجًا كما يلي:
if (fish >= 50) {
console.log("Big catch!");
count = count + 1;
console.log("Big fish counter:" + count);
}


الاجابة

مسح او تعديل الكود ليصبح هكذا

let fish = 50;
let count = 0;
if (fish >= 50) {
console.log("Big catch!");
count = count + 1;
console.log("Big fish counter:" + count);
}










السؤال الثالث

سننشئ برنامجًا يطبع "Super big catch!" وعدد الأسماك الكبيرة جدًا المصطادة كـ "Super big fish counter" إذا كان حجم السمكة المصطادة 100 سم أو أكبر.

لِنُنشئ برنامجًا كما يلي:
(1) إذا كان fish أكبر من أو يساوي 100، اطبع "Super big catch!" على وحدة التحكم
(2) عندما تصطاد سمكة حجمها 100 سم أو أكبر، أسنِد count+1 إلى المتغيّر count
(3) اطبع "Super big fish counter: قيمة count" على وحدة التحكم
ولكن، يرجى إدخال برنامجي (2) و (3) داخل عبارة if الشرطية من (1).


الاجابة

نكمل الكود من السطر الثاني الي السابع

if (fish >= 100) {
console.log("Super big catch!");
count = count + 1;
console.log("Super big fish counter:" + count);
}


الكود الكامل

let fish = 120;
let count = 0;
if (fish >= 100) {
console.log("Super big catch!");
count = count + 1;
console.log("Super big fish counter:" + count);
}




................................................................................................................................................


الدرس الثالث

السؤال الاول


سننشئ برنامجًا يقوم بنزهة في الحديقة إذا كان الجو مشمسًا، وإلا يتناول الغداء في المنزل.
نصرّح عن متغيّر يسمى weather، ونسند إليه القيمة "sunny".

(1) إذا كان المتغيّر weather هو "sunny"، اطبع "Picnic in the park" على وحدة التحكم
(2) إذا لم يتحقق الشرط، اطبع "Lunch at home" على وحدة التحكم


الاجابة

نكتب الكود من السطر الثاني

if (weather == "sunny") {
console.log("Picnic in the park");
} else {
console.log("Lunch at home");
}


الكود الكامل

let weather = "sunny";
if (weather == "sunny") {
console.log("Picnic in the park");
} else {
console.log("Lunch at home");
}











السؤال الثاني

سننشئ برنامجًا يطبع "Let's buy bread and go for a picnic" إذا كان الجو مشمسًا والمخبز مفتوحًا (OPEN)، وإلا يقوم بـ "Lunch at home".
نصرّح عن متغيّر يسمى weather، ونسند إليه القيمة "sunny".

لنكمل البرنامج كما يلي:
① صرّح عن المتغيّر shop وأسنِد إليه القيمة "OPEN"
② إذا كان المتغيّر shop هو OPEN، اطبع "Let's buy bread and go for a picnic" على وحدة التحكم


الاجابة

نكتب الكود في المكان المخصص

let shop = "OPEN";


shop == "OPEN"


شكل الكود بالكامل

let weather = "sunny";
let shop = "OPEN";

if (weather == "sunny") {
if (shop == "OPEN") {
console.log("Let's buy bread and go for a picnic");
}
} else {
console.log("Lunch at home");
}












السؤال الثالث

سننشئ برنامجًا يطبع "Let's buy bread and go for a picnic" إذا كان الجو مشمسًا والمخبز مفتوحًا (OPEN)، و"Let's buy apple and go for a picnic" إذا لم يكن مفتوحًا، و"Lunch at home" إذا كان الجو ممطرًا.
تم إسناد قيمة المتغيّر shop إلى "CLOSED".

لنكمل البرنامج كما يلي:
(1) إذا لم يتحقق الشرط، اطبع "Let's buy apple and go for a picnic" على وحدة التحكم


الاجابة

نكتب في الاماكن الثلاثة المخصصة  للكتابة الاتي

else {


console.log("Let's buy apple and go for a picnic");


}


شكل الكود بالكامل

let weather = "sunny";
let shop = "CLOSED";

if (weather == "sunny") {
if (shop == "OPEN") {
console.log("Let's buy bread and go for a picnic");
} else {
console.log("Let's buy apple and go for a picnic");
}
} else {
console.log("Lunch at home");
}




................................................................................................................................................


الدرس الرابع

السؤال الاول

سننشئ برنامجًا يطبع "Let's go on the field trip" إذا كان الجو مشمسًا، وإلا "Field trip canceled".
نصرّح عن متغيّر يسمى weather، ونسند إليه القيمة "sunny".

① إذا كان المتغيّر weather مشمسًا، اطبع "Let's go on the field trip" على وحدة التحكم
② إذا لم يتحقق الشرط، اطبع "Field trip canceled" على وحدة التحكم

الاجابة

نكتب الكود الاتي من السطر الثاني

if (weather == "sunny") {
console.log("Let's go on the field trip");
} else {
console.log("Field trip canceled");
}


الكود بالكامل

let weather = "sunny";
if (weather == "sunny") {
console.log("Let's go on the field trip");
} else {
console.log("Field trip canceled");
}














السؤال الثاني

سننشئ برنامجًا يطبع "Destination is the zoo" إذا كان الجو مشمسًا وفي المجموعة A، و"Destination is the museum" إذا لم يكن في المجموعة A، و"Field trip canceled" إذا كان الجو ممطرًا.
تم إسناد قيمة المتغيّر group إلى "Group A".

لنكمل البرنامج كما يلي:
① إذا كان الجو مشمسًا، وإذا كان المتغيّر group هو Group A، اطبع "Destination is the zoo" على وحدة التحكم
② إذا لم يتحقق الشرط، اطبع "Destination is the museum" على وحدة التحكم

الاجابة

مسح او تعديل الكود ليصبح بهذا الشكل بدون اي تغيير حتي السطر الثالث يصبح فارغ كما مكتوب

let weather = "sunny";
let group = "Group A";

if (weather == "sunny") {
if (group == "Group A") {
console.log("Destination is the zoo");
} else {
console.log("Destination is the museum");
}
} else {
console.log("Field trip canceled");
}










السؤال الثالث

سننشئ برنامجًا يطبع "Destination is the zoo" إذا كان الجو مشمسًا وفي المجموعة A، و"Destination is the museum" إذا كان في المجموعة B، و"Destination is the art museum" إذا كان في المجموعة C، و"Field trip canceled" إذا كان الجو ممطرًا.
تم إسناد قيمة المتغيّر group إلى "Group C".

لنكمل البرنامج كما يلي:
① إذا كان الجو مشمسًا، وإذا كان المتغيّر group هو Group B، اطبع "Destination is the museum" على وحدة التحكم
② إذا لم يتحقق الشرط، اطبع "Destination is the art museum" على وحدة التحكم


الاجابة

مسح او تعديل الكود ليصبح بهذا الشكل بدون اي تغيير حتي السطر الثالث يصبح فارغ كما مكتوب


let weather = "sunny";
let group = "Group C";

if (weather == "sunny") {
if (group == "Group A") {
console.log("Destination is the zoo");
} else if (group == "Group B") {
console.log("Destination is the museum");
} else {
console.log("Destination is the art museum");
}
} else {
console.log("Field trip canceled");
}






....................................................................................................................................


مراجعة المستوي 29
حل مراجعة المستوي 29


السؤال الاول

أضف شرطًا ثانيًا إلى البرنامج المكتوب:
إذا كانت A أصغر من B، اطبع 'B is bigger' على وحدة التحكم.
تعبير الشرط الثاني هو 'A < B'.

الاجابة

اكمل او عدل الكود ليصبح هكذا

let A = 5;
let B = 10;
if (A > B) {
console.log("A is bigger");
} else if (A < B) {
console.log("B is bigger");
}











السؤال الثاني

حدد نتيجة الإخراج من تنفيذ البرنامج التالي:

let A = 500;
let B = 0;
if (A >= 1) {
B = B + 100;
console.log(B);
}


الاجابة

100
















السؤال الثالث

حدد نتيجة الإخراج من تنفيذ البرنامج التالي:

let weather = "sunny";
let group = "B group";

if (weather == "sunny") {
if (group == "A group") {
console.log("Destination is the park");
} else {
console.log("Destination is the amusement park");
}
} else {
console.log("Destination is the aquarium");
}


الاجابة

Destination is the amusement park










السؤال الرابع

أنشئ برنامجًا يتحقق مما إذا كان المتغيّر weather مشمسًا، ثم يتحقق مما إذا كان المتجر مفتوحًا (OPEN)، وإذا كان مفتوحًا، يطبع 'Go to the shop'.

أنشئ برنامجًا كما يلي:
① إذا كان الجو مشمسًا، وإذا كان المتجر مفتوحًا (OPEN)، اطبع 'Go to the shop' على وحدة التحكم
※أنشئ برنامجًا متداخلاً.

الاجابة

مسح او تعديل الكود ليصبح بهذا الشكل بدون اي تغيير حتي السطر الثالث يصبح فارغ كما مكتوب


let weather = "sunny";
let shop = "OPEN";

if (weather == "sunny") {
if (shop == "OPEN") {
console.log("Go to the shop");
}
} else {
console.log("Staying at home");
}













السؤال الخامس

لِنُنشئ برنامجًا يغير الوجهة بناءً على الوقت من اليوم إذا كان الطقس ممطرًا (rain)، ويذهب في نزهة إذا لم يكن ممطرًا.
بالنسبة للطقس الممطر، الوجهات هي: السينما في الصباح، والمكتبة في الظهيرة، والبقاء في المنزل في الحالات الأخرى.

أكمل البرنامج باتباع هذه الخطوات:
① معالجة متفرعة بناءً على ما إذا كان المتغيّر weather هو rain أو شيء آخر
② أنشئ برنامجًا للحالة التي يكون فيها الطقس rain
　・إذا كان المتغيّر time هو morning، اطبع "Let's go to the movie theater"
　・إذا كان المتغيّر time هو noon، اطبع "Let's go to the library"
　・في الحالات الأخرى، اطبع "Let's stay at home"
③ إذا لم يكن المتغيّر weather هو rain، اطبع "Let's go for a walk"


الاجابة

مسح او تعديل الكود ليصبح بهذا الشكل بدون اي تغيير حتي السطر الثالث يصبح فارغ كما مكتوب

let weather = "rain";
let time = "morning";

if (weather == "rain") {
if (time == "morning") {
console.log("Let's go to the movie theater");
} else if (time == "noon") {
console.log("Let's go to the library");
} else {
console.log("Let's stay at home");
}
} else {
console.log("Let's go for a walk");
}





</pre>`
,
30: `<pre dir="rtl">السؤال الاول

سننشئ برنامجًا يطبع جميع قيم درجات الحرارة السبعة على وحدة التحكم.
أدخل البرنامج كما يلي:
for (let degree of degreeList) {
console.log(degree);
}


الاجابة

نكتب من السطر الثاني الكود التالي

for (let degree of degreeList) {
console.log(degree);
}


الكود كامل

let degreeList = [8, 6, 11, 10, 9, 7, 12];
for (let degree of degreeList) {
console.log(degree);
}













السؤال الثاني

سننشئ برنامجًا يطبع جميع قيم المتغيّر wordList على وحدة التحكم.
السلاسل النصية التي ستضاف إلى wordList: tomato، carrot، onion

استخدم for...of لطباعة جميع قيم المتغيّر wordList.
ولكن، يجب أن يكون المتغيّر الذي تسند إليه القيم المجتلبة من المتغيّر wordList هو word.


الاجابة

let wordList = ["tomato", "carrot", "onion"];
for (let word of wordList) {
console.log(word);
}














السؤال الثالث

سننشئ برنامجًا يطبع "Big catch" وعدد الأسماك الكبيرة المصطادة كـ "Big fish counter" إذا كان حجم السمكة المصطادة 50 سم أو أكبر.

أدخل برنامجًا مشابهًا لما يلي:
if (fish >= 50) {
console.log("Big catch!！");
big = big + 1;
console.log("Big fish counter:" + big);
}


الاجابة

مسح او تعديل الكود ليصبح هكذا

let fish = 50;
let big = 0;
if (fish >= 50) {
console.log("Big catch!！");
big = big + 1;
console.log("Big fish counter:" + big);
}















السؤال الرابع

سننشئ برنامجًا يطبع "Buy bread and have a picnic" إذا كان الجو مشمسًا والمخبز مفتوحًا (OPEN)، وإلا يقوم بـ "Lunch at home".
نصرّح عن متغيّر يسمى weather، ونسند إليه القيمة "sunny".

لنكمل البرنامج كما يلي:
① في السطر 2، صرّح عن المتغيّر shop وأسنِد إليه القيمة "OPEN"
② في حالة الجو المشمس، إذا كان المتغيّر shop هو OPEN، اطبع "Buy bread and have a picnic" على وحدة التحكم


الاجابة

نسخ او تعديل الكود ليصبح هكذا بدون اي تغيير السطر الثالث كما امامك يترك فارغ

let weather = "sunny";
let shop = "OPEN";

if (weather == "sunny") {
if (shop == "OPEN") {
console.log("Buy bread and have a picnic");
}
} else {
console.log("Lunch at home");
}



















السؤال الخامس

سننشئ برنامجًا يطبع "Destination is the zoo" إذا كان الجو مشمسًا وفي المجموعة A، و "Destination is the museum" إذا لم يكن في المجموعة A، و "Field trip canceled" إذا كان الجو ممطرًا.
تم إسناد قيمة المتغيّر group إلى "Group A".

لنكمل البرنامج كما يلي:
(1) إذا كان الجو مشمسًا، وإذا كان المتغيّر group هو Group A، اطبع "Destination is the zoo" على وحدة التحكم
(2) إذا كان الجو مشمسًا، وإذا كان المتغيّر group هو Group B، اطبع "Destination is the museum" على وحدة التحكم
(3) إذا لم يتحقق الشرط، اطبع "Destination is the museum" على وحدة التحكم


الاجابة

نسخ او تعديل الكود ليصبح هكذا بدون اي تغيير السطر الثالث كما امامك يترك فارغ

let weather = "sunny";
let group = "Group B";

if (weather == "sunny") {
if (group == "Group A") {
console.log("Destination is the zoo");
} else if (group == "Group B") {
console.log("Destination is the museum");
} else {
console.log("Destination is the art museum");
}
} else {
console.log("Field trip canceled");
}





.................................................................................................................................................


اختبار منتصف الطريق المستوي 30
مراجعة المستوي 30
حل مراجعة المستوي 30




السؤال الاول

يرجى تحديد نتيجة تنفيذ البرنامج التالي.

let numList = [5, 6, 7];
for (let i = 0; i < numList.length; i++) {
console.log(numList[i]);
}


الاجابة

5
6
7


















السؤال الثاني

سننشئ برنامجًا يطبع جميع قيم المتغيّر numList على وحدة التحكم.

أنشئ برنامجًا كما يلي:
① استخدم for...of لطباعة جميع قيم المتغيّر numList
ولكن، يجب أن يكون المتغيّر الذي تسند إليه القيم المجتلبة من المتغيّر numList هو num.


الاجابة

كتابة الكود التالي من السطر الثاني

for (let num of numList) {
console.log(num);
}


الكود كامل

let numList = [2, 4, 6, 8];
for (let num of numList) {
console.log(num);
}


















السؤال الثالث

سننشئ برنامجًا يطبع جميع قيم المتغيّر wordList على وحدة التحكم.
نحن نضيف سلاسل نصية إلى wordList.

استخدم for...of لطباعة جميع قيم المتغيّر wordList
ولكن، يجب أن يكون المتغيّر الذي تسند إليه القيم المجتلبة من المتغيّر wordList هو word.

الاجابة

نكتب من السطر الثاني الكود التالي

for (let word of wordList) {
console.log(word);
}


الكود كامل

let wordList = ["Good morning", "Good night", "Hello"];
for (let word of wordList) {
console.log(word);
}















السؤال الرابع

حدد نتيجة الإخراج من تنفيذ البرنامج التالي:

let A = 500;
let B = 0;
if (A >= 1) {
B = B + 100;
console.log(B);
}


الاجابة

100
















السؤال الخامس

حدد نتيجة الإخراج من تنفيذ البرنامج التالي:

let weather = "sunny";
let group = "B group";
if (weather == "sunny") {
if (group == "A group") {
console.log("Destination is the park");
} else {
console.log("Destination is the amusement park");
}
} else {
console.log("Destination is the aquarium");
}

الاجابة

Destination is the amusement park























السؤال السادس

لِنُنشئ برنامجًا يغير الوجهة بناءً على الوقت من اليوم إذا كان الطقس ممطرًا (rain)، ويذهب في نزهة إذا لم يكن ممطرًا.
بالنسبة للطقس الممطر، الوجهات هي: السينما في الصباح، والمكتبة في الظهيرة، والبقاء في المنزل في الحالات الأخرى.

أكمل البرنامج باتباع هذه الخطوات:
① معالجة متفرعة بناءً على ما إذا كان المتغيّر weather هو rain أو شيء آخر
② أنشئ برنامجًا للحالة التي يكون فيها الطقس rain
　・إذا كان المتغيّر time هو morning، اطبع "Let's go to the movie theater"
　・إذا كان المتغيّر time هو noon، اطبع "Let's go to the library"
　・في الحالات الأخرى، اطبع "Let's stay at home"
③ إذا لم يكن المتغيّر weather هو rain، اطبع "Let's go for a walk"


الاجابة

مسح ونسخ الكود او تعديل الكود مع مراعاة ان السطر الثالث فارغ كما هو موضح

let weather = "rain";
let time = "morning";

if (weather == "rain") {
if (time == "morning") {
console.log("Let's go to the movie theater");
} else if (time == "noon") {
console.log("Let's go to the library");
} else {
console.log("Let's stay at home");
}
} else {
console.log("Let's go for a walk");
}





</pre>`
,
31: `<pre dir="rtl">السؤال الاول

سننشئ دالة تجمع بين قيمتين عدديتين.

لننشئ البرنامج التالي:
① أنشئ دالة بالاسم sum ومعها المتغيران freestyle وbreaststroke
② أسند قيمة freestyle + breaststroke إلى المتغير result
③ أعد المتغير result
*سيتم إدخال البرنامج الذي يستدعي الدالة في فقرة "هيا نجرب" التالية.


الاجابة

function sum(freestyle, breaststroke) {
let result = freestyle + breaststroke;
return result;
}
















السؤال الثاني

سننشئ دالة تجمع أزمنة السباحة الحرة وسباحة الصدر.

أدخل البرنامج كما يلي:

console.log(sum(39.5,60.5));


الاجابة

نكتب في المكان المخصص لكتابة الكود

console.log(sum(39.5, 60.5));


شكل الكود بالكامل

function sum(freestyle, breaststroke) {
let result = freestyle + breaststroke;
return result;
}
console.log(sum(39.5, 60.5));




















السؤال الثالث

سننشئ دالة تجمع أزمنة السباحة الحرة وسباحة الصدر.

لنُدخل البرنامج التالي ابتداءً من السطر 6.
let teamRed = sum(39.5,60.5);
console.log(teamRed);


الاجابة

اضافة الكود التالى في السطر السادس والسابع بعد الاكواد المكتوبة

let teamRed = sum(39.5, 60.5);
console.log(teamRed);


الكود بالكامل

function sum(freestyle, breaststroke) {
let time = freestyle + breaststroke;
return time;
}
//Write your program below.
let teamRed = sum(39.5, 60.5);
console.log(teamRed);








............................................................................................................................................


الدرس الثاني


السؤال الاول


سننشئ دالة تجمع أزمنة السباقات الثلاثة.

أنشئ المعامل backstroke وأضفه إلى مجموع المعاملات.
مرّر القيمة 58.5 كوسيط عند استدعاء الدالة sum.


الاجابة

نكتب في الاماكن المخصصة لكتابة الكود


backstroke

backstroke

58.5


شكل الكود النهائي بالكامل

function sum(freestyle, breaststroke, backstroke) {
let time = freestyle + breaststroke + backstroke;
return time;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);















السؤال الثاني


"سوف نستدعي الدالة التي تجمع ثلاث قيم عددية.

لننشئ البرنامج التالي ابتداءً من السطر 7.
(1) أعلن المتغير teamBlue وأسند إليه الدالة sum.
ولكن مرّر القيم 40، 62، و58 إلى الدالة sum.
(2) اعرض قيمة المتغير teamBlue في وحدة التحكم (console)."


الاجابة

كتابة الكود التالي في السطرين السابع والثامن بعد الكود المكتوب

let teamBlue = sum(40, 62, 58);
console.log(teamBlue);


الكود بالكامل

function sum(freestyle, breaststroke, backstroke) {
let time = freestyle + breaststroke + backstroke;
return time;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);
let teamBlue = sum(40, 62, 58);
console.log(teamBlue);


















السؤال الثالث

"سوف نستدعي الدالة التي تجمع ثلاث قيم عددية.

لننشئ البرنامج التالي ابتداءً من السطر 9.
(1) أعلن المتغير teamGreen وأسند إليه الدالة sum.
ولكن مرّر القيم 41، 59.5، و60 إلى الدالة sum.
(2) اعرض قيمة المتغير teamGreen في وحدة التحكم (console)."


الاجابة

كتابة الكود التالي في السطرين التاسع والعاشر بعد الكود المكتوب

let teamGreen = sum(41, 59.5, 60);
console.log(teamGreen);


الكود بالكامل

function sum(freestyle, breaststroke, backstroke) {
let time = freestyle + breaststroke + backstroke;
return time;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);
let teamBlue = sum(40, 62, 58);
console.log(teamBlue);
let teamGreen = sum(41, 59.5, 60);
console.log(teamGreen);












...............................................................................................................................................


الدرس الثالث

السؤال الاول

اضغط على "تشغيل الكود" دون تعديل البرنامج.

نضغط علي تشغيل الكود فقط
















السؤال الثاني

سوف نعرض أسرع وقت بين المجموع الكلي لأزمنة الفرق الثلاثة.

يرجى إدخال البرنامج التالي في السطر 11.

console.log("The fastest time is" + Math.min(158.5, 160, 160.5));


الاجابة

نكتب في المكان المخصص لكتابة الكودفي اخر سطر

Math.min(158.5, 160, 160.5)


شكل الكود بالكامل

function sum(freestyle, breaststroke, backstroke) {
let time = freestyle + breaststroke + backstroke;
return time;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);
let teamBlue = sum(40, 62, 58);
console.log(teamBlue);
let teamGreen = sum(41, 59.5, 60);
console.log(teamGreen);
console.log("The fastest time is" + Math.min(158.5, 160, 160.5));
























السؤال الثالث

سوف نعرض أسرع وقت بين المجموع الكلي لأزمنة الفرق الثلاثة.

يرجى إدخال البرنامج التالي في السطر 11.
console.log("The fastest time is" + Math.min(teamRed, teamBlue, teamGreen));


الاجابة

نكتب في المكان المخصص لكتابة الكود في اخر سطر

Math.min(teamRed, teamBlue, teamGreen)


شكل الكود بالكامل

function sum(freestyle, breaststroke, backstroke) {
let time = freestyle + breaststroke + backstroke;
return time;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);
let teamBlue = sum(40, 62, 58);
console.log(teamBlue);
let teamGreen = sum(41, 59.5, 60);
console.log(teamGreen);
console.log("The fastest time is" + Math.min(teamRed, teamBlue, teamGreen));








.......................................................................................................................................


مراجعة المستوي 31


حل مراجعة المستوي 31


السؤال الاول


سننشئ دالة باسم calculation3 تقوم بضرب ثلاث قيم a وb وc (أي a×b×c).

يرجى إنشاء الدالة calculation3 كما يلي:
(1) أنشئ الدالة calculation3 بالمعاملات a وb وc.
(2) اضرب قيم المعاملات a وb وc (a×b×c)، وأسند الناتج إلى المتغير result.


الاجابة
مسح ونسخ او تعديل الكود ليكون هكذا


function calculation3(a, b, c){
let result = a * b * c;
return result;
}
console.log(calculation3(2, 3, 4));
















السؤال الثاني

اختر البرنامج الصحيح الذي يمرر الوسائط الثلاثة 3 و5 و10 إلى الدالة calculation3 ويعرض الناتج في وحدة التحكم.


الاجابة

console.log(calculation3(3, 5, 10));

















السؤال الثالث

سننشئ برنامجًا عند عرض قيمة المتغير num1 في وحدة التحكم، تظهر نفس القيمة الناتجة عن عملية حساب الدالة calculation3.

دون حذف البرنامج الأصلي، أنشئ البرنامج في السطر الخامس كما يلي:
(1) أعلن المتغير num1، وأسند إليه ناتج الدالة calculation3.
يرجى تمرير القيم 5 و10 و15 كوسائط إلى الدالة.


الاجابة


مسح ونسخ او تعديل الكود ليصبح هكذا


function calculation3(a, b, c) {
let result = a * b * c;
return result;
}
let num1 = calculation3(5, 10, 15);
console.log(num1);


















السؤال الرابع

سننشئ برنامجًا عند عرض قيمة المتغير num2 في وحدة التحكم، تظهر نفس القيمة الناتجة عن عملية حساب الدالة calculation3.

دون حذف البرنامج الأصلي، أنشئ البرنامج ابتداءً من السطر السابع كما يلي:
(1) أعلن المتغير num2، وأسند إليه ناتج الدالة calculation3.
يرجى تمرير القيم 4 و4 و4 كوسائط إلى الدالة.
(2) اعرض قيمة المتغير num2 في وحدة التحكم.


الاجابة


مسح ونسخ او تعديل الكود ليصبح هكذا


function calculation3(a, b, c) {
let result = a * b * c;
return result;
}
let num1 = calculation3(5, 10, 15);
console.log(num1);
let num2 = calculation3(4, 4, 4);
console.log(num2);















السؤال الخامس

دالة Math.min تُرجع أصغر قيمة من بين الوسائط المُمرَّرة إليها.
يرجى اختيار البرنامج الذي يعرض أصغر قيمة من بين المتغيرات num1 وnum2 وnum3.


الاجابة

console.log(Math.min(num1, num2, num3));









</pre>`
,
32: `<pre dir="rtl">السؤال الاول

اطبع جميع القيم الموجودة في المصفوفة.

أدخل البرنامج نفسه كما هو موضح أدناه.
for (let day of volunteerList) {
console.log(day);
}


الاجابة

نكتب في المكان المخصص لكتابة الكود

let day of volunteerList


شكل الكود الكامل

let volunteerList = ["Yes", "No", "Yes", "Yes", "Yes", "Yes", "No", "No", "Yes", "Yes", "Yes", "No", "Yes", "No"];
for (let day of volunteerList) {
console.log(day);
}















السؤال الثاني

سننشئ برنامجًا يحسب ويطبع عدد المرات التي تحتوي فيها المصفوفة على القيمة "Yes".

لنُدخل البرنامج نفسه كما هو موضح أدناه ابتداءً من السطر الرابع.
let count = 0;
for (let day of volunteerList) {
if (day == ""Yes"") {
count++;
}
}
console.log(count);


الاجابة

مسح ونسخ الكود او تعديل الكود يصبح هكذا

let volunteerList = ["Yes", "No", "Yes", "Yes", "Yes", "Yes", "No", "No", "Yes", "Yes", "Yes", "No", "Yes", "No"];
let count = 0;
for (let day of volunteerList) {
if (day == "Yes") {
count++;
}
}
console.log(count);

















السؤال الثالث

تأكد من أن نص المسألة والبرنامج في المحرر متطابقان.

"سننشئ برنامجًا يحسب ويطبع عدد المرات التي تحتوي فيها المصفوفة على القيمة "No".

لننشئ البرنامج ابتداءً من السطر الرابع كما يلي:
① إذا كانت قيمة المتغير day هي "No"، أضف 1 إلى المتغير count.
ومع ذلك، استخدم عملية الزيادة (increment) لإضافة 1 إلى المتغير count.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let volunteerList = ["Yes", "No", "Yes", "Yes", "Yes", "Yes", "No", "No", "Yes", "Yes", "Yes", "No", "Yes", "No"];
let count = 0;
for (let day of volunteerList) {
if (day == "No") {
count++;
}
}
console.log(count);














...................................................................................................................................................


الدرس الثاني


لا يوجد به اسئلة


...............................................................................................................................................


الدرس الثالث


السؤال الاول

أنشئ برنامجك كما يلي:
① إذا كانت قيمة المتغير sandwichType هي "savory"، اطبع ""تحقق مما بداخل الشطيرة"" في وحدة التحكم،
وإلا فاطبع "كُل شطيرة المربى بالفراولة".


الاجابة

كتابة الكود التالي من السطر الثاني

if (sandwichType == "savory") {
console.log("Check what's inside the sandwich");
} else {
console.log("Eat strawberry jam sandwich");
}


الكود الكامل النهائي

let sandwichType = "strawberry jam";
if (sandwichType == "savory") {
console.log("Check what's inside the sandwich");
} else {
console.log("Eat strawberry jam sandwich");
}
















السؤال الثاني

بما أن هذا برنامج من نوع "إذا حدث كذا، افعل ○○، وإلا افعل △△"، نستخدم جملة if-else.

"إذا كانت الشطيرة من النوع المالح، سننشئ برنامجًا يطبع ""بدّل مع كودي"" إذا كانت تونة،
وإلا يطبع "كُل شطيرة لحم".

لننشئ البرنامج ابتداءً من السطر الرابع كما يلي:
① إذا كانت قيمة المتغير savory هي "tuna"، اطبع "بدّل مع كودي" في وحدة التحكم،
وإلا اطبع "كُل شطيرة لحم".


الاجابة

مسح ونسخ او تعديل الكود ليكون هكذا

let sandwichType = "savory";
let savory = "tuna";
if (sandwichType == "savory") {
if (savory == "tuna") {
console.log("Exchange with Cody");
} else {
console.log("Eat ham sandwich");
}
} else {
console.log("Eat strawberry jam sandwich");
}










....................................................................................................................................................

مراجعة المستوي 32
حل مراجعة المستوي 32




السؤال الاول

البرنامج أدناه يعرض القيم الموجودة في المتغير scoreList بالترتيب. يرجى اختيار التعبير المناسب لكتابته داخل القوسين في جملة for من بين الخيارات أدناه.

let scoreList = [70, 80, 66, 88, 92];
for (　) {
console.log(score);
}


الاجابة

let score of scoreList















السؤال الثاني

يرجى اختيار ناتج الإخراج الصحيح للبرنامج أدناه.

let scoreList = [70, 80, 66, 88, 92];
for (let score of scoreList) {
if (score >= 80) {
console.log(score);
}
}


الاجابة

80 88 92
















السؤال الثالث


يرجى كتابة برنامج يعرض فقط القيم من المتغير height التي تساوي أو تزيد عن 150.
لا تحذف البرنامج الأصلي.


الاجابة

مسح ونسخ الكود او التعديل ليكون هكذا بدون اي تغيير مع مراعاة ان السطر الثاني فارغ كما هو واضح


let heightList = [154, 138, 140, 180, 170];

for (let height of heightList) {
if (height >= 150) {
console.log(height);
}
}
















السؤال الرابع

يُستخدم المخطط الانسيابي أدناه لتحديد ما إذا كان الشخص يستطيع ركوب الأفعوانية أم لا. من بين الخيارات أدناه، اختر العبارة غير الصحيحة بناءً على ما يمكن استنتاجه من هذا المخطط الانسيابي.


الاجابة

إذا كان طولك 140 سم أو أكثر، يمكنك الركوب بمفردك.

















السؤال الخامس

يرجى إنشاء برنامج متداخل يحتوي على جمل if داخل if بناءً على المخطط الانسيابي.
استخدم المتغير height للطول والمتغير age للعمر.

إذا كان العمر 12 سنة أو أكثر، فاعرض ""يمكنك الركوب بمفردك""،
وإلا فاعرض ""يُرجى الركوب مع شخص يبلغ 18 سنة أو أكثر"".


الاجابة

مسح ونسخ الكود او التعديل ليكون هكذا بدون اي تغيير مع مراعاة ان السطر الثالث فارغ كما هو واضح


let height = 148;
let age = 14;

if (height >= 140) {
if (age >= 12) {
console.log("You can ride alone");
} else {
console.log("Please ride with someone who is 18 years or older");
}
} else {
console.log("You cannot ride");
}










</pre>`
,
33: `<pre dir="rtl">السؤال الاول

سننشئ دالة تجمع القيم الزمنية للأنواع الثلاثة.
لننشئ البرنامج التالي:
① أنشئ دالة باسم sum بوسائط freestyle وbreaststroke وbackstroke
② أسند freestyle + breaststroke + backstroke إلى المتغير result
③ أعد المتغير result
*سيتم إدخال برنامج استدعاء هذه الدالة في فقرة "هيا نجرب" التالية.


الاجابة

function sum(freestyle, breaststroke, backstroke) {
let result = freestyle + breaststroke + backstroke;
return result;
}














السؤال الثاني

سننشئ دالة تجمع القيم الزمنية للأنواع الثلاثة.
لنُدخل البرنامج التالي ابتداءً من السطر الخامس.
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);


الاجابة

كتابة الكود التالي في السطرين الخامس والسادس بعد الاكواد المكتوبة

let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);


الكود الكامل

function sum(freestyle, breaststroke,backstroke) {
let result = freestyle + breaststroke +backstroke;
return result;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);
















السؤال الثالث

سنستدعي دالة تجمع ثلاث قيم عددية.

لننشئ برنامجًا ابتداءً من السطر 7 كما يلي:
① أعلن المتغير teamBlue وأسند إليه الدالة sum، ولكن مرّر القيم 40 و62 و58 إلى الدالة sum.
② اعرض قيمة المتغير teamBlue في وحدة التحكم
③ أعلن المتغير teamGreen وأسند إليه الدالة sum، ولكن مرّر القيم 41 و59.5 و60 إلى الدالة sum.
④ اعرض قيمة المتغير teamGreen في وحدة التحكم


الاجابة

كتابة الكود التالي بعد الاكواد المكتوبه من السطر السابع الي العاشر

let teamBlue = sum(40, 62, 58);
console.log(teamBlue);
let teamGreen = sum(41, 59.5, 60);
console.log(teamGreen);


شكل الكود الكامل

function sum(freestyle, breaststroke, backstroke) {
let time = freestyle + breaststroke + backstroke;
return time;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);
let teamBlue = sum(40, 62, 58);
console.log(teamBlue);
let teamGreen = sum(41, 59.5, 60);
console.log(teamGreen);
















السؤال الرابع

سنطبع أسرع زمن إجمالي بين الفرق الثلاثة.

يرجى إدخال البرنامج التالي في السطر 11.
console.log(""The fastest time is"" + Math.min(teamRed, teamBlue, teamGreen));


الاجابة

نكتب في المكان المخصص لكتابة الكود في السطر الاخير

Math.min(teamRed, teamBlue, teamGreen)


شكل الكود بالكامل

function sum(freestyle, breaststroke, backstroke) {
let time = freestyle + breaststroke + backstroke;
return time;
}
let teamRed = sum(39.5, 60.5, 58.5);
console.log(teamRed);
let teamBlue = sum(40, 62, 58);
console.log(teamBlue);
let teamGreen = sum(41, 59.5, 60);
console.log(teamGreen);
console.log("The fastest time is" + Math.min(teamRed, teamBlue, teamGreen));













السؤال الخامس

اطبع جميع القيم الموجودة في المصفوفة.
أدخل البرنامج نفسه كما يلي.

for (let day of volunteerList) {
console.log(day);
}



الاجابة

نكتب في المكان المخصص لكتابة الكود

let day of volunteerList


شكل الكود بالكامل

let volunteerList = ["Yes", "No", "Yes", "Yes", "Yes", "Yes", "No", "No", "Yes", "Yes", "Yes", "No", "Yes", "No"];
for (let day of volunteerList) {
console.log(day);
}














السؤال السادس

سننشئ برنامجًا يحسب ويطبع عدد مرات "Yes" في المصفوفة.
لنُدخل البرنامج نفسه كما يلي ابتداءً من السطر الرابع.

let count = 0;
for (let day of volunteerList) {
if (day == ""Yes"") {
count++;
}
}
console.log(count);


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let volunteerList = ["Yes", "No", "Yes", "Yes", "Yes", "Yes", "No", "No", "Yes", "Yes", "Yes", "No", "Yes", "No"];
let count = 0;
for (let day of volunteerList) {
if (day == "Yes") {
count++;
}
}
console.log(count);

















السؤال السابع

سننشئ برنامجًا بناءً على المخطط الانسيابي.

لننشئ البرنامج التالي ابتداءً من السطر الثاني:
① إذا كانت قيمة المتغير "weather" هي "sunny"، فاطبع "exercise"، وإلا فاطبع "read a book"


الاجابة

كتابة الكود التالي من السطر الثاني

if (weather == "sunny") {
console.log("exercise");
} else {
console.log("read a book");
}


الكود بالكامل

let weather = "sunny";
if (weather == "sunny") {
console.log("exercise");
} else {
console.log("read a book");
}












السؤال الثامن

إذا كانت الشطيرة من النوع المالح، سننشئ برنامجًا يطبع "Exchange with Cody" إذا كانت من نوع التونة، وإلا يطبع "Eat ham sandwich".

لننشئ البرنامج ابتداءً من السطر 4 كما يلي:
① إذا كانت قيمة المتغير savory هي "tuna"، فاطبع "Exchange with Cody" في وحدة التحكم، وإلا فاطبع "Eat ham sandwich"


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let sandwichType = "savory";
let savory = "tuna";
if (sandwichType == "savory") {
if (savory == "tuna") {
console.log("Exchange with Cody");
} else {
console.log("Eat ham sandwich");
}
} else {
console.log("Eat strawberry jam sandwich");
}








.................................................................................................................................................
اختبار منتصف الطريق المستوي 33
حل اختبار منتصف الطريق المستوي 33


السؤال الاول

اختر البرنامج الصحيح الذي يمرّر الوسائط الثلاثة 3 و5 و10 إلى الدالة calc3 ويعرض الناتج في وحدة التحكم.

الاجابة

console.log(calc3(3, 5, 10));











السؤال الثاني

سننشئ برنامجًا عند عرض قيمة المتغير num1 في وحدة التحكم، تظهر نفس القيمة الناتجة عن عملية الحساب في الدالة calc3.

دون حذف البرنامج الأصلي، أنشئ البرنامج في السطر الخامس كما يلي:
① أعلن المتغير num1، وأسند إليه ناتج الدالة calc3.
يرجى تمرير القيم 5 و10 و15 كوسائط إلى الدالة.

الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

function calc3(a, b, c) {
let result = a * b * c;
return result;
}
let num1 = calc3(5, 10, 15);
console.log(num1);











السؤال الثالث

سننشئ برنامجًا عند عرض قيمة المتغير num2 في وحدة التحكم، تظهر نفس القيمة الناتجة عن عملية الحساب في الدالة calc3.

دون حذف البرنامج الأصلي، أنشئ البرنامج ابتداءً من السطر السابع كما يلي:
① أعلن المتغير num2، وأسند إليه ناتج الدالة calc3.
يرجى تمرير القيم 4 و4 و4 كوسائط إلى الدالة.
② اعرض قيمة المتغير num2 في وحدة التحكم.

الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

function calc3(a, b, c) {
let result = a * b * c;
return result;
}
let num1 = calc3(5, 10, 15);
console.log(num1);
let num2 = calc3(4, 4, 4);
console.log(num2);











السؤال الرابع

دالة Math.min تُرجع أصغر قيمة من بين الوسائط المُمرَّرة إليها.
يرجى اختيار البرنامج الذي يعرض أصغر قيمة من بين المتغيرات num1 وnum2 وnum3.

الاجابة

console.log(Math.min(num1, num2, num3));












السؤال الخامس

يرجى اختيار ناتج الإخراج الصحيح للبرنامج أدناه:

let scoreList = [70, 80, 66, 88, 92];
for (let score of scoreList) {
if (score >= 80) {
console.log(score);
}
}

الاجابة

80 88 92












السؤال السادس

يرجى كتابة برنامج يعرض فقط القيم من المتغير height التي تساوي أو تزيد عن 150.
لا تحذف البرنامج الأصلي.

الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا دون اي تغيرر مع مراعاة ان السطر الثاني فارغ كما واضح


let heightList = [154, 138, 140, 180, 170];

for (let height of heightList) {
if (height >= 150) {
console.log(height);
}
}









السؤال السابع

يُستخدم المخطط الانسيابي أدناه لتحديد ما إذا كان الشخص يستطيع ركوب الأفعوانية أم لا.
من بين الخيارات أدناه، اختر العبارة الخاطئة بناءً على ما يمكن استنتاجه من هذا المخطط الانسيابي.

الاجابة

إذا كان عمرك 12 سنة أو أكثر وكان طولك 140 سم أو أكثر، يمكنك الركوب بمفردك.







</pre>`
,
34: `<pre dir="rtl">السؤال الاول

سننشئ برنامج بطولة رياضية. أولاً، فلنُظهر العنوان.

أدخل ما يلي في المحرر:
<h1>Sports Tournament Program</h1>


الاجابة

<h1>Sports Tournament Program</h1>










السؤال الثاني

سننشئ برنامج بطولة رياضية. فلنضف عنوان الأحداث.

أدخل ما يلي في السطر الثاني من المحرر:
<p>Events</p>


الاجابة

نكتب في السطر الثاني الكود الاتى

<p>Events</p>


الكود كامل

<h1>Sports Tournament Program</h1>
<p>Events</p>










السؤال الثالث

سننشئ برنامج بطولة رياضية. فلنضف قائمة بالأحداث.

أدخل ما يلي في المحرر ابتداءً من السطر الثالث:
<ul>
<li>Frisbee</li>
<li>Softball</li>
<li>Bread-eating race</li>
</ul>


الاجابة

نكتب من السطر الثالث الكود التالي

<ul>
<li>Frisbee</li>
<li>Softball</li>
<li>Bread-eating race</li>
</ul>


الكود كامل

<h1>Sports Tournament Program</h1>
<p>Events</p>
<ul>
<li>Frisbee</li>
<li>Softball</li>
<li>Bread-eating race</li>
</ul>













السؤال الرابع

سننشئ برنامج بطولة رياضية. وأخيرًا فلنضف صورة.

أدخل ما يلي في السطر الثامن:
<img src="sports.png">


الاجابة

نكتب في السطر الثامن بعد الاكواد المكتوبة

<img src="sports.png">


الكود كامل

<h1>Sports Tournament Program</h1>
<p>Events</p>
<ul>
<li>Frisbee</li>
<li>Softball</li>
<li>Bread-eating race</li>
</ul>
<img src="sports.png">





................................................................................................................................................


الدرس الثاني

السؤال الاول

انقر على تشغيل الكود دون إجراء أي تغييرات.
اضغط علي تشغيل الكود فقط







السؤال الثاني

انقر على تشغيل الكود دون إجراء أي تغييرات.
اضغط علي تشغيل الكود فقط







السؤال الثالث

انقر على تشغيل الكود دون إجراء أي تغييرات.
اضغط علي تشغيل الكود فقط














السؤال الرابع

سنُغيّر لون كلمة sea في السطر الأول إلى اللون الأزرق.
* يحتوي ملف CSS بالفعل على إعداد يجعل لون النص أزرق.

أدخل ما يلي في المحرر:
<p>Let's go to the <span>sea</span></p>


الاجابة

نكتب في الاماكن المخصصة لكتابة الكود في السطر الاول

<span>

</span>


شكل الكود النهائي

<p>Let's go to the <span>sea</span></p>
<p class="mountain">Let's go to the mountains</p>
















السؤال الخامس

سنُغيّر لون كلمة sea إلى الأزرق، وmountain إلى الأخضر.
* يحتوي CSS على إعدادات لتغيير ألوان النصوص.

أدخل ما يلي في المحرر:
<p>Let's go to the <span class="sea">sea</span></p>
<p>Let's go to the <span class="mountain">mountain</span></p>


الاجابة

نكتب في الاماكن المخصصة لكتابة الكود

class="sea"


class="mountain"


شكل الكود بالكامل

<p>Let's go to the <span class="sea">sea</span></p>
<p>Let's go to the <span class="mountain">mountain</span></p>










السؤال السادس

سنُغيّر لون كلمة Apple إلى الأحمر، وGiraffe إلى الأصفر، وLight blue sneakers إلى الأزرق الفاتح.
* يحتوي CSS على إعدادات لتغيير الألوان.

أدخل ما يلي في المحرر:
① أحط كلمة Apple بعنصر span وأضف خاصية class بقيمة "apple"
② أحط كلمة Giraffe بعنصر span وأضف خاصية class بقيمة "giraffe"
③ أحط عبارة Light blue sneakers بعنصر span وأضف خاصية class بقيمة "sneaker"


الاجابة

مسح ونسخ الكود او تعديل الكود ليصبح هكذا

<p>My favorite fruit is <span class="apple">Apple</span></p>
<p>My favorite animal is <span class="giraffe">Giraffe</span></p>
<p>Today's shoes are <span class="sneaker">Light blue sneakers</span></p>






..............................................................................................................................................


الدرس الثالث


السؤال الاول

انقر على تشغيل الكود دون إجراء أي تغييرات.
اضغط علي تشغيل الكود فقط










السؤال الثاني

سننشئ استبيانًا. أولاً، فلنُظهر حقل إدخال الرأي.

أدخل ما يلي في السطر الثالث من المحرر:
<input type="text">


الاجابة

نكتب في السطر الثالث الكود التالي

<input type="text">


الكود الكامل


<h1>Event Content Survey</h1>
<p>Opinion</p>
<input type="text">














السؤال الثالث

سننشئ استبيانًا. فلنُظهر زرًّا بجانب حقل إدخال الرأي.

أدخل ما يلي في السطر الرابع من المحرر:
<input type="button">


الاجابة

نكتب في السطر الرابع الكود الاتى

<input type="button">


الكود الكامل

<h1>Event Content Survey</h1>
<p>Opinion</p>
<input type="text">
<input type="button">













السؤال الرابع

سننشئ استبيانًا. فلنُظهر زر الإرسال بجانب حقل إدخال الرأي.

عدّل السطر الرابع كما يلي:
<input type="button" value="Submit">


الاجابة

مسح او تعديل الكود ليصبح هكذا

<h1>Event Content Survey</h1>
<p>Opinion</p>
<input type="text">
<input type="button" value="Submit">













السؤال الخامس

سننشئ استبيانًا. فلنُظهر حقل إدخال رأي وزر إرسال.

أدخل كود HTML التالي ابتداءً من السطر الثالث:
① استخدم وسم input لإظهار حقل نصي
② استخدم وسم input لإظهار زر مكتوب عليه Submit

الاجابة

كتابة الكود التالي في السطرين الثالث والرابع

<input type="text">
<input type="button" value="Submit">


الكود الكامل

<h1>Event Content Survey</h1>
<p>Opinion</p>
<input type="text">
<input type="button" value="Submit">







...............................................................................................................................................


مراجعة المستوي 34
حل مراجعة المستوي 34


السؤال الاول

أنشئ قائمة نقطية باستخدام وسوم ul تتضمن العناصر: Hamburger، وPizza، وSandwich أسفل عرض كلمة Menu.


الاجابة

مسح ونسخ الكود او التعديل ليكون هكذا

<p>Menu</p>
<ul>
<li>Hamburger</li>
<li>Pizza</li>
<li>Sandwich</li>
</ul>










السؤال الثاني

يرجى اختيار كود الـ HTML الصحيح الذي يعرض صورة باسم الملف cody.png.

الاجابة

<img src="cody.png">











السؤال الثالث

يرجى اختيار النتيجة الصحيحة عند تنفيذ كود الـ HTML وCSS التاليين:

HTML
<p><span class="tomato">Tomato</span>Hamburger</p>
CSS
.tomato { color: red; }


الاجابة

باللون الاحمر "Tomato" يتم عرض النص 












السؤال الرابع

يرجى اختيار كود الـ HTML الذي سيُعرض كما هو موضّح في الصورة أدناه.


الاجابة

<p>Phone Number</p>
<input type="text">
<input type="button" value="Enter">














السؤال الخامس

يرجى إضافة السمة value إلى كود الـ HTML المكتوب.
اضبط القيمة لتكون "Submit".


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

<input type="button" value="Submit">






</pre>`
,
35: `<pre dir="rtl">السؤال الاول

انقر على "تشغيل الكود" دون إجراء أي تغييرات.
اضغط علي تشغيل الكود فقط










السؤال الثاني

سنقوم بإنشاء قائمة الواجبات المنزلية.
لنجعل عنوان Homework List باللون الأحمر.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في المحرر:
h1 {
color: red;
}


الاجابة

h1 {
color: red;
}












السؤال الثالث

سنقوم بإنشاء قائمة الواجبات المنزلية.
لنجعل لون الخلفية للعنوان Homework List ورديًا.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر الثالث من المحرر:
background-color: pink;


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

h1 {
color: red;
background-color: pink;
}


















السؤال الرابع

سننشئ قائمة الواجبات المنزلية.
لنغيّر حجم النص وسمكه لعناصر القائمة.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر الخامس من المحرر:
li {
font-size: 24px;
font-weight: 900;
}


الاجابة

كتابة الكود من السطر الخامس الي الثامن

li {
font-size: 24px;
font-weight: 900;
}



الكود كامل

h1 {
color: red;
background-color: pink;
}
li {
font-size: 24px;
font-weight: 900;
}


















السؤال الخامس

سننشئ قائمة الواجبات المنزلية.
لنغيّر لون نص عنصر Math Practice فقط في القائمة إلى اللون الأزرق.
أولًا، أضف سمة class إلى كود HTML.

عدّل السطر الرابع كما يلي:
<li class="blue">Math Practice</li>

الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

<h1>Homework List</h1>
<ul>
<li>History Study</li>
<li class="blue">Math Practice</li>
<li>Essay</li>
</ul>
















السؤال السادس

سننشئ قائمة الواجبات المنزلية.
لنغيّر لون نص Math Practice فقط إلى اللون الأزرق.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر التاسع من المحرر:
.blue {
color: blue;
}


الاجابة

كتابة الكود بعد الاكواد المكتوبة من السطر التاسع

.blue {
color: blue;
}



الكود الكامل

h1 {
color: red;
background-color: pink;
}
li {
font-size: 24px;
font-weight: 900;
}
.blue {
color: blue;
}









...........................................................................................................................................


الدرس الثاني


السؤال الاول

انقر على "تشغيل الكود" دون إجراء أي تغييرات.
نضغط علي تشغيل الكود فقط









السؤال الثاني

انقر على "تشغيل الكود" دون إجراء أي تغييرات.
نضغط علي تشغيل الكود فقط












السؤال الثالث

سننشئ صفحة تصويت.
لنجعل زر التصويت First one باللون الأزرق الفاتح.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في المحرر:
background-color: aqua;


الاجابة

نكتب في المكان المخصص لكتابة الكود

background-color: aqua;


شكل الكود النهائي

.btn1 {
background-color: aqua;
}












السؤال الرابع

سننشئ صفحة تصويت.
لنجعل زر التصويت Second one يتحول إلى اللون الأصفر فقط عند تمرير الفأرة عليه.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي من السطر الرابع في المحرر:
.btn2:hover {
background-color: yellow;
}


الاجابة

نكتب من السطر الرابع الكود الاتي

.btn2:hover {
background-color: yellow;
}



الكود كامل

.btn1 {
background-color: aqua;
}
.btn2:hover {
background-color: yellow;
}














السؤال الخامس

سننشئ صفحة تصويت.
لنجعل زر التصويت First one يتحول إلى اللون الأصفر المخضر عند تمرير الفأرة عليه.
* كود HTML مكتوب بالفعل.

عدّل الأسطر من 1 إلى 3 كما يلي:
.btn1:hover {
background-color: lime;
}


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

.btn1:hover {
background-color: lime;
}
.btn2:hover {
background-color: yellow;
}








..............................................................................................................................................


الدرس الثالث

السؤال الاول

انقر على "تشغيل الكود" دون إجراء أي تغييرات.
نضغط علي تشغيل الكود فقط










السؤال الثاني

انقر على "تشغيل الكود" دون إجراء أي تغييرات.
نضغط علي تشغيل الكود فقط










السؤال الثالث

سنزيّن أزرار صفحة التصويت.
لنجعل زر التصويت First one يتحول إلى اللون الأصفر المخضر تدريجيًا خلال ثانيتين عند تمرير الفأرة عليه.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر الثالث من المحرر:

transition: 2s;


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

.btn1:hover {
background-color: lime;
transition: 2s;
}
.btn2:hover {
background-color: yellow;
}












السؤال الرابع

سنزيّن أزرار صفحة التصويت.
لنجعل زر التصويت Second one يتحول إلى اللون الأصفر تدريجيًا خلال خمس ثوانٍ عند تمرير الفأرة عليه.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر السابع من المحرر:

transition: 5s;


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

.btn1:hover {
background-color: lime;
transition: 2s;
}
.btn2:hover {
background-color: yellow;
transition: 5s;
}






.................................................................................................................................................

الدرس الرابع


السؤال الاول

انقر على "تشغيل الكود" دون إجراء أي تغييرات.
اضغط علي تشغيل الكود فقط






السؤال الثاني

انقر على "تشغيل الكود" دون إجراء أي تغييرات.
اضغط علي تشغيل الكود فقط











السؤال الثالث

لنزيّن قائمة الأمتعة.
لنضف خطًا واحدًا كإطار حول العنوان Packing List.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر الثاني من المحرر:
border: solid;


الاجابة

مسح ونسخ الكود او تعديل الكود ليصبح هكذا

h1 {
border: solid;
}










السؤال الرابع

لنزيّن قائمة الأمتعة.
لنضف إطارًا مزدوج الخطوط حول العنوان Packing List.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر الثاني من المحرر:
border: double;


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

h1 {
border: double;
}










السؤال الخامس

لنزيّن قائمة الأمتعة.
لنجعل الإطار المزدوج أكثر سُمكًا.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر الثاني من المحرر:
border: 10px double;


الاجابة

نكتب في المكان المخصص لكتابة الكود

10px


شكل الكود بالكامل

h1 {
border: 10px double;
}











السؤال السادس

لنزيّن قائمة الأمتعة.
لنجعل الإطار المزدوج باللون الأزرق.
* كود HTML مكتوب بالفعل.

أدخل الكود التالي في السطر الثاني من المحرر:
border: 10px double blue;


الاجابة

نكتب في المكان المخصص لكتابة الكود

blue

شكل الكود بالكامل

h1 {
border: 10px double blue;
}








السؤال السابع

لنزيّن قائمة الأمتعة.
لنجعل الإطار بخط أحمر واحد حول العنوان Packing List.
* كود HTML مكتوب بالفعل.

أضف خاصية border في السطر الثاني.
حدد القيم كما يلي: النوع solid، السُمك 5px، اللون red.
* يُرجى تحديد القيم بترتيب سُمك الإطار، النوع، اللون.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون بهذا الشكل

h1 {
border: 5px solid red;
}







...................................................................................................................................................


مراجعة المستوي 35
حل مراجعة المستوي 35




السؤال الاول

يرجى اختيار الطريقة الصحيحة لإضافة خاصية class إلى <p>CAT</p>.


الاجابة

<p class="cat">CAT</p>









السؤال الثاني

يرجى اختيار كود CSS الذي يجعل الزر المُنشأ بالكود التالي يتحول إلى اللون الأحمر عند لمس الفأرة له:

HTML
<input type="button" value="Agree" class="btn">


الاجابة

.btn:hover {
background-color: red;
}









السؤال الثالث

يرجى اختيار كود CSS الذي يجعل لون الزر يتغيّر إلى الأحمر خلال 5 ثوانٍ عند لمس الفأرة له.


الاجابة

.btn:hover {
background-color: red;
transition: 5s;
}











السؤال الرابع

عند إضافة حدّ، تُستخدم خاصية border. يرجى اختيار القيمة التي تضيف حدًّا مزدوج الخطوط.


الاجابة

double










السؤال الخامس

يرجى اختيار كود CSS الذي يضيف حدًا إلى وسم h1، بحيث يكون نوع الحد خطًا واحدًا ، السُمك 10px، ولون الحد أزرق.


الاجابة

h1 {
border: 10px solid blue;
}






</pre>`
,
36: `<pre dir="rtl">السؤال الاول

سنعرض العنوان والصورة لبرنامج مهرجان الرياضة.

يرجى إدخال كود HTML التالي:
① في السطر الأول، استخدم وسم h1 لعرض Sports Festival Program
② في السطر الثاني، استخدم وسم img لعرض الصورة sports.png


الاجابة

<h1>Sports Festival Program</h1>
<img src="sports.png">










السؤال الثاني

سنُغيّر لون نص كلمة Apple إلى الأحمر، وكلمة Giraffe إلى الأصفر.
* ملف CSS يحتوي بالفعل على التعليمات لتغيير الألوان.

يرجى إدخال الكود التالي في المحرر:
① أحط كلمة Apple بوسمي span، وأضف خاصية class بقيمة apple
② أحط كلمة Giraffe بوسمي span، وأضف خاصية class بقيمة giraffe


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

<p>My favorite fruit is <span class="apple">Apple</span></p>
<p>My favorite animal is <span class="giraffe">Giraffe</span></p>












السؤال الثالث

سنُنشئ استبيانًا. لنُظهر خانة لإدخال الرأي وزر إرسال.

يرجى كتابة كود HTML من السطر الثالث كما يلي:
<input type="text">
<input type="button" value="Submit">


الاجابة

كتابة الكود في السطرين الثالث والرابع

<input type="text">
<input type="button" value="Submit">


الكود كامل

<h1>Event Content Survey</h1>
<p>Opinion</p>
<input type="text">
<input type="button" value="Submit">












السؤال الرابع

سوف نزيّن نص قائمة الواجبات (Homework List).
* ملف HTML مكتوب مسبقًا.

يرجى كتابة كود CSS التالي:
① لتغيير لون خلفية الوسم h1، استخدم الخاصية background-color، والقيمة pink
② لتغيير وزن الخط لعناصر li، استخدم الخاصية font-weight، والقيمة bold
③ لتغيير لون النص للعنصر ذي الفئة red، استخدم الخاصية color، والقيمة red


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

h1 {
background-color: pink;
}
li {
font-weight: bold;
}
.red {
color: red;
}










السؤال الخامس

لنزيّن أزرار التصويت.
عندما تلمس الفأرة زر First one، يجب أن يتحول إلى اللون الأصفر المخضر،
وعندما تلمس زر Second one، يجب أن يتحول إلى الأصفر خلال ثانيتين.
* ملف HTML مكتوب مسبقًا.

يرجى إدخال الكود التالي في المحرر:

.btn1:hover { background-color: lime; } .btn2:hover background-color: yellow; transition: 2s; }


الاجابة

مسح ونسخ الكود او تعديل الكود ليصبح بهذا الشكل

.btn1:hover {
background-color: lime;
}
.btn2:hover {
background-color: yellow;
transition: 2s;
}











السؤال السادس

"لنُحيط عنوان Packing List بإطار.
* ملف HTML مكتوب مسبقًا.

يرجى إدخال الكود التالي في السطر الثاني من المحرر:

border: 10px double red;"


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

h1 {
border: 10px double red;
}






.............................................................................................................................................

اختبار منتصف الطريق المستوي 36
حل اختبار منتصف الطريق المستوي 36
حل مراجعة المستوي 36


السؤال الاول

أنشئ قائمة نقطية باستخدام وسم ul تعرض العناصر "Hamburger" و "Pizza" و "Sandwich" أسفل العنوان "Menu".


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

<p>Menu</p>
<ul>
<li>Hamburger</li>
<li>Pizza</li>
<li>Sandwich</li>
</ul>








السؤال الثاني

يرجى اختيار النتيجة الصحيحة عند تنفيذ التعليمات البرمجية التالية في HTML وCSS:

HTML
<p><span class="tomato">Tomato</span>Hamburger</p>
CSS
.tomato {
color: red;
}


الاجابة

باللون الاحمر "Tomato" يتم عرض النص











السؤال الثالث

يرجى اختيار كود HTML الذي سيُعرَض كما هو موضح في الصورة أدناه.


الاجابة

<p>Phone Number</p>
<input type="text">
<input type="button" value="Enter">











السؤال الرابع

يرجى إضافة خاصية value إلى كود HTML المكتوب، واجعل القيمة "Submit".


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

<input type="button" value="Submit">










السؤال الخامس

يرجى اختيار كود CSS الذي سيجعل الزر المُنشأ بالكود التالي يتحوّل إلى اللون الأحمر عند لمس الفأرة له.

HTML

<input type="button" value="Agree" class="btn">


الاجابة 

.btn:hover {
background-color: red;
}









السؤال السادس

يرجى اختيار كود CSS الذي سيجعل لون الزر يتحول إلى الأحمر خلال 5 ثوانٍ عند لمس الفأرة له.

الاجابة

.btn:hover {
background-color: red;
transition: 5s;
}










السؤال السابع

عند إضافة إطار (border)، تُستخدم الخاصية border.
يرجى اختيار القيمة التي تُضيف إطارًا مزدوج الخطّين.

الاجابة

double












السؤال الثامن

يرجى اختيار كود CSS لإضافة إطار إلى وسم h1، بحيث يكون نوع الإطار خطًا واحدًا، وسماكته 10px، ولونه أزرق.

الاجابة

h1 {
border: 10px solid blue;
}





</pre>`
,
37: `<pre dir="rtl">السؤال الاول

اضغط على "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط













السؤال الثاني

سوف نقوم بنشر برنامج للتنبؤ بالمصلحة حسب فصيلة الدم.
لنضفي برنامج مصنوع "حظك اليوم جيد" إذا كانت فصيلة الدم A.
فصيلة محددة بالمتغير فصيلة الدم، وتم تعيين القيمة A له.

لنقم بإنشاء البرنامج من السطر الثالث كما يلي:
① إذا كانت قيمة المتغير فصيلة الدم هي A، فاعرض "حظك يوم جيد" في وحدة التحكم.


رد:

نكتب الكود التالي من السطر الثالث وترك السطر الثاني كامل

if (bloodType == "A") {
console.log("ثروة اليوم لائقة");
}


الكود كامل مع مراعاه السطر الثاني

Let bloodType = "A";

if (bloodType == "A") {
console.log("ثروة اليوم جيدة");
}













السؤال الثالث

سنبتكر برنامجًا للتنبؤ بالمصلحة حسب فصيلة الدم.
لن يعرض المنتج نتائج مختلفة إذا كانت فصيلة الدم B أو O أو AB مختلف من A.
فصيلة محددة بالمتغير فصيلة الدم، وتم تعيين القيمة "B" له.

لننشئ البرنامج من السطر الخامس باستخدام "else if" كما يلي:
① إذا كانت فصيلة الدم B، فاعرض "حظك اليوم رائع!"
② إذا كانت فصيلة الدم O، فاعرض "يبدو أن حظك اليوم جيد!"
③ إذا كانت فصيلة الدم AB، فاعرض "قد لا يكون حظك اليوم جيدًا…"


الإجابة على

التحليل ونسخ الكود أو تعديل الكود ليكون هكذا مع السطر الثاني كامل

Let bloodType = "B";

if (bloodType == "A") {
console.log("ثروة اليوم جيدة");
} else if (bloodType == "B") {
console.log("ثروة اليوم ممتازة!");
} else if (bloodType == "O") {
console.log("الثروة اليوم تبدو جيدة!");
} else if (bloodType == "AB") {
console.log("الثروة اليوم قد لا تكون جيدة جدًا...");
}













السؤال الرابع

سننشئ برنامجًا للتنبؤ بالمصلحة حسب فصيلة الدم.
لنضف منها المنتج "دعنا فصيلة دمك!" إذا لم يتحقق أي شرط.
فصيلة محددة من الدم بالمتغير فصيلة الدم، وتم تعيين القيمة "غير معروف" له.

لنقم بإنشاء البرنامج من السطر 11 كما يلي:
① إذا لم يتحقق أي شرط، فاعرض "تشجعنا فصيلة دمك!" في وحدة التحكم.


للحصول على إذن

ونسخ الكود أو تعديل القانون ليصبح هكذا مع السطر الثاني الكامل

Let bloodType = "Unknown";

if (bloodType == "A") {
console.log("ثروة اليوم جيدة");
} else if (bloodType == "B") {
console.log("ثروة اليوم ممتازة!
} else if (bloodType == "O") {
console.log("يبدو حظ اليوم جيدًا!");
} else if (bloodType == "AB") {
console.log("قد لا يكون حظ اليوم جيدًا...");
} else {
console.log("دعنا نكتشف فصيلة دمك!");
}









................................................................................................................................


الدرس الثاني

السؤال الأول

اضغط على "تشغيل الكود" دون تعديل البرنامج.
اضغط علي تشغيل الكود فقط









السؤال الثاني

تم تعيين القيمة C لتغيير فصيلة الدم.
اضغط على "تشغيل الكود" دون تعديل البرنامج.


إذن

نضغط على تشغيل الكود فقط













السؤال الثالث

ويقوم ببرنامج للتنبؤ بالمصلحة حسب فصيلة الدم باستخدام جملة التبديل.
لن نكمل البرنامج لعرض نتائج مختلفة حسب فصيلة الدم.
فصيلة محددة من الدم بالمتغير فصيلة الدم، وتم تعيين القيمة B له.

لنكتب البرنامج كما يلي:
Switch (bloodType) {
case "A":
console.log("حظك يوم جيد");
استراحة؛
...
} نكتب في النواقص كود


الكود الكبير فاصل الكود النهائي الشامل Let bloodType = "B"; التبديل (نوع الدم) { الحالة "أ": console.log("ثروة اليوم جيدة"); استراحة؛ الحالة "ب": console.log("ثروة اليوم ممتازة!"); استراحة؛ الحالة "O": console.log("الثروة اليوم تبدو جيدة!"); استراحة؛ الحالة "AB": console.log("الثروة اليوم قد لا تكون جيدة جدًا..."); استراحة؛ الافتراضي: console.log("دعونا نعرف فصيلة دمك!"); استراحة؛ } السؤال الرابع سننشئ برنامجًا للتنبؤ بالحظ حسب فصيلة الدم باستخدام Switch. لن نكمل البرنامج لعرض نتائج مختلفة حسب فصيلة الدم. فصيلة محددة من الدم بالمتغير فصيلة الدم، وتم تعيين القيمة C له. لنُدخل الكود التالي من السطر 16 فصاعدًا: default: console.log("Let's find your blood type!"); استراحة؛ لنكتب في الاماكن المحددة للكود الكودي في السطرين 16 - 18 الاتى الافتراضي فاصل الكود النهائي الكامل Let bloodType = "C"; التبديل (نوع الدم) { الحالة "أ": console.log("ثروة اليوم جيدة"); استراحة؛ الحالة "ب": console.log("ثروة اليوم ممتازة!"); استراحة؛ الحالة "O": console.log("الثروة اليوم تبدو جيدة!"); استراحة؛ case "AB": console.log("قد لا يكون حظ اليوم جيدًا جدًا..."); break; default: console.log("دعنا نكتشف فصيلة دمك!""); استراحة; } ........................................................................................................................... الدرس الثالث




































































































السؤال الاول

سننشئ برنامج للتنبؤ باحظوظ حسب فصيلة الدم باستخدام Switch.
لنكمل البرنامج ليعرض "حظك اليوم جيد" إذا كانت فصيلة الدم A.
فصيلة الدم المحددة بالمتغير bloodType، وتم تعيين القيمة A له.

لنكتب البرنامج كما يلي:
Switch (bloodType) {
case "A":
console.log("ثروة اليوم لائقة");
استراحة؛
} بدلاً


من

التعديل ونسخ الكود أو تعديل الكود ليصبح هكذا مع السطر الثاني الكامل


Let bloodType = "A";

التبديل (نوع الدم) {
الحالة "أ":
console.log("ثروة اليوم جيدة");
استراحة؛
}














السؤال الثاني

سننشئ برنامجًا للتنبؤ بالحظ حسب فصيلة الدم باستخدام Switch.
لن أكمل البرنامج ليعرض "حظك اليوم رائع!" إذا كانت فصيلة الدم B.
فصيلة الدم المحددة بالمتغير فصيلة الدم، وتم تعيين القيمة B له.

لنكتب نفس الكود في السطرين 7 و9:
الحالة "B":
console.log("ثروة اليوم ممتازة!");
استراحة؛


كبديل

ونسخ الكود أو تعديل الكود ليكون هكذا مع السطر الثاني الكامل

Let bloodType = "B";

التبديل (نوع الدم) {
الحالة "أ":
console.log("ثروة اليوم جيدة");
استراحة؛
الحالة "ب":
console.log("ثروة اليوم ممتازة!");
استراحة؛
}















السؤال الثالث

سننشئ برنامجًا للتنبؤ بالحظ حسب فصيلة الدم باستخدام Switch.
لن نكمل البرنامج ليعرض نتائج مختلفة لفصائل الدم O وAB.
فصيلة محددة من الدم بالمتغير فصيلة الدم، وتم تعيين القيمة AB له.

لننشئ البرنامج كما يلي:
① من السطر 10، إذا كانت فصيلة الدم O، فاعرض "يبدو أنك حظيت بيوم جيد!".
② من السطر 13، إذا كانت فصيلة الدم AB، فاعرض "قد لا يكون حظك اليوم جيدًا…".


كبديل

ونسخ الكود أو تعديل القانون ليصبح هكذا مع السطر الثاني الكامل

Let bloodType = "AB";

التبديل (نوع الدم) {
الحالة "أ":
console.log("ثروة اليوم جيدة");
استراحة؛
الحالة "ب":
console.log("ثروة اليوم ممتازة!");
استراحة؛
الحالة "O":
console.log("الثروة اليوم تبدو جيدة!");
استراحة؛
الحالة "AB":
console.log("الثروة اليوم قد لا تكون جيدة جدًا...");
استراحة؛
}










السؤال الرابع

سننشئ برنامجًا للتنبؤ بالحظ حسب فصيلة الدم باستخدام Switch.
لنُكمل البرنامج لعرض "دعمنا لفصيلة دمك!" عندما لا تتطابق مع أي من الشروط.
فصيلة محددة من الدم بالمتغير فصيلة الدم، وتم تعيين القيمة "غير معروف" له.

لنقم بإنشاء البرنامج من السطر 16 كما يلي:
① إذا لم تتطابق مع أي من الشروط، فاعرض "دعنا فصيلة دمك!" في وحدة التحكم.


نعم

تعديل ونسخ الكود أو تعديل الكود ليصبح هكذا مع السطر الثاني كامل

Let bloodType = "Unknown";

التبديل (نوع الدم) {
الحالة "أ":
console.log("ثروة اليوم جيدة");
استراحة؛
الحالة "ب":
console.log("ثروة اليوم ممتازة!");
استراحة؛
الحالة "O":
console.log("الثروة اليوم تبدو جيدة!");
استراحة؛
الحالة "AB":
console.log("الثروة اليوم قد لا تكون جيدة جدًا...");
استراحة؛
الافتراضي:
console.log("دعونا نعرف فصيلة دمك!");
استراحة؛
}











السؤال الخامس


سننشئ برنامجًا باستخدام التبديل الموجود في الجدول اليومي حسب اليوم.
اليوم المحدد بالمتغير يوم، وتم تعيين قيمة "الأحد" له.

أكمل البرنامج كما يلي:
① إذا كان اليوم "السبت"، اعرض "اذهب إلى الإسماعيل".
② إذا كان اليوم "الأحد"، اعرض "اذهب للتسوق".
③ إذا لم يتطابق أي شيء، اعرض "اذهب إلى المدرسة".


لنكتب

في الاماكن المخصصة للكود


الكودي تبديل

اليوم

حالة

استراحة

حالة

استراحة

افتراضية

استراحة كول


كود كامل

Let day = "Sunday";

التبديل (اليوم) {
الحالة "السبت":
console.log("اذهب إلى الدروس");
استراحة؛
الحالة "الأحد":
console.log("اذهب للتسوق");
استراحة؛
الافتراضي:
console.log("اذهب إلى المدرسة");
استراحة؛
}








..................................................................................................................................................


مراجعة المستوي 37
حل مراجعة المستوي 37


السؤال الاول

هذا برنامج يُخرج الكلمة "Red" إذا كانت النص المُسندة إلى المتغير color هي "red".

يرجى إضافة البرنامج التالي ابتداءً من السطر الخامس:
① إذا كان المتغير اللون يساوي "أزرق"، و"أزرق" في وحدة التحكم (وحدة التحكم)
② إذا كان المتغير اللون يساوي "أخضر"، واتخاذ "أخضر" في وحدة التحكم (وحدة التحكم)
ومع ذلك، يرجى كتابة البرنامج باستخدام else if.

إلى

حل ونسخ الكود أو تعديل القانون ليكون هكذا مع مراعاه السطر الثاني كامل

Let color = "green";

إذا كان اللون أحمر، فسيتم
طباعة "أحمر" في وحدة التحكم.
وإذا كان اللون أزرق، فسيتم
طباعة "أزرق" في وحدة التحكم.
وإذا كان اللون أخضر، فسيتم طباعة "أخضر" في
وحدة التحكم.سجل("أخضر");
}











السؤال الثاني

في أي حالات يتم تنفيذها بطريقة عملية في القسم الافتراضي من عبارة التبديل؟ يرجى اختيار الإجابة الصحيحة.


رد

(الحالات)عندما لا تتطابق القيمة مع أيٍّ من الحالات













السؤال الثالث

البرنامج أدناه يُخرج الفترة الزمنية الرئيسية على الحقبة العسكرية المُدخلة في عصر المتغير.
يرجى اختيار النتيجة النهائية للإخراج.

<البرنامج>

Letera = "Medieval";

التبديل (عصر) {
الحالة "حديثة":
console.log("1900~");
استراحة؛
الحالة "صناعية":
console.log("1760~1900");
استراحة؛
الحالة "العصور الوسطى":
console.log("500~1500");
استراحة؛
الحالة "القديمة":
console.log("3000 قبل الميلاد ~ 500 م");
استراحة؛
}


إلى

500~1500











السؤال الرابع

يرجى إنشاء برنامج باستخدام فعل التبديل بحيث يشمل الموافقة على القيمة المتغيرة.

① إذا كانت القيمة أ، و"أحسنت!" إلى وحدة التحكم
② إذا كانت القيمة B، يجب "استمر في العمل الجيد" إلى وحدة التحكم
③ إذا كانت القيمة C، يجب أن "دعونا نحاول بجهد أكبر قليلاً" إلى وحدة التحكم بدلاً من الحل


ونسخ

الكود أو تعديل الكود ليكون هكذا مع مراعاه السطر الثاني كامل

Let letter = "B";

التبديل (حرف) {
الحالة "أ":
console.log("أحسنت!");
استراحة؛
الحالة "ب":
console.log("واصل العمل الجيد");
استراحة؛
الحالة "C":
console.log("دعونا نحاول بجهد أكبر");
استراحة؛
}














السؤال الخامس

" لقد نشأنا برنامجًا باستخدام معنى التبديل بحيث يشمل الموافقة على القيم المتغير letter.
يرجى إضافة التالي:

① إذا لم تتطابق أي من الحالات (الحالات) مع القيم، واختر "التدوين غير صحيح" إلى وحدة التحكم بدلاً من التعديل


ونسخ الكود او تعديل القانون ليكون

هكذا مع مراعاه السطر الثاني كامل Let letter =

"D "; العمل الجيد"); استراحة؛ الحالة "C": console.log("دعونا نحاول بجهد أكبر"); استراحة; الافتراضي: console.log("التدوين غير صحيح"); استراحة; 

</pre>`
,
38: `<pre dir="rtl">السؤال الاول

سوف نقوم بإنشاء برنامج يُخرج الباقي عند قسمة 20 قطعة بسكويت على 3 أشخاص.

لنُدخل البرنامج كما يلي:
① أخرج قيمة المتغير cookies مقسومة على 3


الاجابة

نكتب في المكان المخصص لكتابة الكود

cookies / 3


شكل الكود بالكامل

let cookies = 20;
console.log(cookies / 3);












السؤال الثاني

انقر على "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط













السؤال الثالث

سوف نقوم بإنشاء برنامج يُخرج الباقي عند قسمة 35 وجبة خفيفة على 6 أشخاص.

لنُدخل البرنامج كما يلي:
① أخرج الباقي (القيمة المعيارية) عند قسمة المتغير snacks على 6


الاجابة

نكتب في المكان المخصص لكتابة الكود

snacks % 6


شكل الكود بالكامل

let snacks = 35;
console.log(snacks % 6);








..............................................................................................................................................

الدرس الثاني

السؤال الاول

سوف نقوم بإنشاء برنامج لمعرفة عدد الأشخاص الذين سيبقون بدون مجموعة كاملة عند تشكيل مجموعات من 6 أشخاص من فريق مكون من 40 شخصًا.

لنُدخل البرنامج كما يلي:
① أخرج الباقي (modulo) عند قسمة المتغير members على 6 في وحدة التحكم (console).


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let members = 40;
console.log(members % 6);













السؤال الثاني

سوف نقوم بإنشاء برنامج يقسم 13 وجبة خفيفة بين 3 أشخاص ويُخرج الجملة "ريك يحصل عليها" إذا وُجد باقي (modulo).
تم إسناد القيمة 13 إلى المتغير snacks.

لنُدخل نفس البرنامج ابتداءً من السطر الثاني:
if (snacks % 3 > 0) {
console.log("Rick gets it");
}


الاجابة

كتابة الكود الاتى من السطر الثاني الي الرابع

if (snacks % 3 > 0) {
console.log("Rick gets it");
}


الكود كامل

let snacks = 13;
if (snacks % 3 > 0) {
console.log("Rick gets it");
}











........................................................................................................................................

الدرس الثالث

السؤال الاول

انقر على "تشغيل الكود" دون تعديل البرنامج.
نضفط علي تشغيل الكود فقط












السؤال الثاني

سنقوم بإنشاء برنامج يقسم 20 قطعة دونات بين 3 أشخاص ويُخرج رسائل مختلفة حسب الباقي من القسمة.
أولاً، سنُخرج "لنُنظّف القمامة بشكلٍ مرتب" عندما يكون الباقي 0.
يُعرّف عدد الدونات في المتغير donuts وتُسنَد له القيمة 20.

لندخل السطر التالي في السطر الثالث:
switch (donuts % 3)


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا مع مراعاة السطر الثاني فارغ

let donuts = 20;

switch (donuts % 3) {
case 0:
console.log("Let's clean up the trash neatly");
break;
}














السؤال الثالث

سنقوم بإنشاء برنامج يقسم 20 قطعة دونات بين 3 أشخاص ويُخرج رسائل مختلفة حسب الباقي.
الآن سنضيف الحالات الخاصة بالباقي 1 والباقي 2.
يُعرّف عدد الدونات في المتغير donuts وتُسنَد له القيمة 20.

لندخل البرنامج ابتداءً من السطر السابع كما يلي:
① إذا كان باقي القسمة 1، أخرج إلى وحدة التحكم "أعطها للأم"
② إذا كان باقي القسمة 2، أخرج إلى وحدة التحكم "أعطها للأم والأب"


الاجابة

} يكتب الكود التالي من السطر السابع الي السطرالثاني عشر مع مراعة بعد الكود في السطر الثالث عشر اغلاق قوس المجموعة

case 1:
console.log("Give it to Mom");
break;
case 2:
console.log("Give it to Mom and Dad");
break;


الكود بالكامل مع مراعاة السطر الثاني فارغ

let donuts = 20;

switch (donuts % 3) {
case 0:
console.log("Let's clean up the trash neatly");
break;
case 1:
console.log("Give it to Mom");
break;
case 2:
console.log("Give it to Mom and Dad");
break;
}










.....................................................................................................................................

مراجعة المستوي 38
حل مراجعة المستوي 38


السؤال الاول

يرجى اختيار ناتج تشغيل البرنامج أدناه.

console.log(5 % 4);

الاجابة

1











السؤال الثاني

يرجى اختيار التعبير الشرطي المناسب من الخيارات والذي يعني عندما تكون قيمة المتغير year قابلة للقسمة على 12 (بدون باقي).


الاجابة

year % 12 == 0












السؤال الثالث

يرجى إنشاء برنامج باستخدام جملة if يقوم بإخراج "Let's eat a hamburger!" إذا كان الباقي عند قسمة قيمة dayCount على 7 يساوي 0.


الاجابة

مسح ونسخ الكود او تعديل الكود ليصبح هكذا مع مراعاة السطر الثاني فارغ كما واضح

let dayCount = 14;

if (dayCount % 7 == 0) {
console.log("Let's eat a hamburger!");
}













السؤال الرابع

يرجى إنشاء برنامج باستخدام جملة switch يقوم بإخراج "Let's eat a hamburger!" إذا كان الباقي عند قسمة dayCount على 7 يساوي 0، ويقوم بإخراج "Let's eat steak!" إذا كان الباقي يساوي 4.


الاجابة

مسح ونسخ الكود او تعديل الكود ليصبح هكذا مع مراعاة السطر الثاني فارغ كما واضح

let dayCount = 11;

switch (dayCount % 7) {
case 0:
console.log("Let's eat a hamburger!");
break;
case 4:
console.log("Let's eat steak!");
break;
}













السؤال الخامس

يرجى إنشاء برنامج يقوم بإخراج "Group A" إذا كان الباقي عند قسمة قيمة number على 3 يساوي 0، و"Group B" إذا كان الباقي 1، و"Group C" إذا كان الباقي 2.
لكن يُرجى استخدام جملة switch.


الاجابة

مسح ونسخ الكود او تعديل الكود ليصبح هكذا مع مراعاة السطر الثاني فارغ كما واضح

let number = 20;

switch (number % 3) {
case 0:
console.log("Group A");
break;
case 1:
console.log("Group B");
break;
case 2:
console.log("Group C");
break;
}






</pre>`
,
39: `<pre dir="rtl">السؤال الاول

انقر على "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط










السؤال الثاني

سننشئ برنامجًا للتنبؤ بالحظ حسب فصيلة الدم باستخدام جملة switch. لنُكمل البرنامج الذي يُظهر نتائج مختلفة بناءً على فصيلة الدم.
تم تعريف فصيلة الدم في المتغير ‎bloodType‎، وتم إسناد القيمة ‎Unknown‎ إليه.

لنُكمل البرنامج بإضافة ما يلي في المحرر:
① إذا كانت القيمة A، اطبع في وحدة التحكم: "Today’s fortune is decent"
② إذا كانت القيمة B، اطبع في وحدة التحكم: "Today’s fortune is excellent!"
③ إذا لم تتطابق أي من القيم، اطبع في وحدة التحكم: "Let’s find out your blood type!"


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا مع مراعاة السطر الثاني فارغ

let bloodType = "Unknown";

switch (bloodType) {
case "A":
console.log("Today's fortune is decent");
break;
case "B":
console.log("Today's fortune is excellent!");
break;
default:
console.log("Let's find out your blood type!");
break;
}













السؤال الثالث

سننشئ برنامجًا يُخرج باقي القسمة (modulo) عند قسمة 20 قطعة بسكويت على 3 أشخاص.
تم تعريف عدد البسكويت في المتغير ‎cookies‎، وتم إسناد القيمة ‎20‎ إليه.

لنُدخل البرنامج كما يلي:
① أخرج باقي القسمة (modulo) عند قسمة المتغير ‎cookies‎ على 3


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let cookies = 20;
console.log(cookies % 3);













السؤال الرابع

سننشئ برنامجًا يطبع "Cody gets it" إذا كان باقي القسمة عند تقسيم 20 قطعة بسكويت على 3 أشخاص أكبر من 0.
تم تعريف عدد البسكويت في المتغير ‎cookies‎، وتم إسناد القيمة ‎20‎ إليه.

لنُدخل البرنامج في عبارة الشرط في السطر 2 كما يلي:
① إذا كان باقي القسمة (modulo) عند قسمة المتغير ‎cookies‎ على 3 أكبر من 0، اطبع في وحدة التحكم "Cody gets it"


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let cookies = 20;
if (cookies % 3 > 0) {
console.log("Cody gets it");
}












السؤال الخامس

سننشئ برنامجًا يقسم 85 برتقالة على 3 أشخاص ويُظهر رسائل مختلفة حسب باقي القسمة (modulo).
يرجى إضافة البرامج التي تُظهر النتائج عندما يكون الباقي 1 أو عندما يكون 2.
تم تعريف عدد البرتقالات في المتغير ‎orange‎، وتم إسناد القيمة ‎85‎ إليه.

لنُدخل البرنامج كما يلي:
① قيمة الشرط هي الـ modulo عند قسمة المتغير ‎orange‎ على 3
② من السطر 7، إذا كان الـ modulo يساوي 1، اطبع في وحدة التحكم "Give it to Grandma"
③ من السطر 10، إذا كان الـ modulo يساوي 2، اطبع في وحدة التحكم "Give it to the neighbors"


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا مع مراعاة ان السطر الثاني فارغ كما واضح

let orange = 85;

switch (orange % 3) {
case 0:
console.log("They were divided equally");
break;
case 1:
console.log("Give it to Grandma");
break;
case 2:
console.log("Give it to the neighbors");
break;
}










................................................................................................................................................
اختبار منتصف الطريق المستوي 39
حل اختبار منتصف الطريق المستوي 39
حل مراجعة المستوي 39




السؤال الاول

في أي الحالات يتم تنفيذ العملية المكتوبة في قسم default من جملة switch؟ يُرجى اختيار الإجابة الصحيحة.

الاجابة

عندما لا تتطابق القيمة مع أي من الحالات










السؤال الثاني

يعرض البرنامج أدناه الفترة الزمنية بناءً على الحقبة التاريخية المُدخلة في المتغير era.

يُرجى اختيار الناتج الصحيح.

<البرنامج>

let era = "Medieval";

switch (era) {
case "Modern":
console.log("1900~");
break;
case "Industrial":
console.log("1760~1900");
break;
case "Medieval":
console.log("500~1500");
break;
case "Ancient":
console.log("3000 BC ~ 500 AD");
break;
}


الاجابة

500~1500










السؤال الثالث

يُرجى إنشاء برنامج باستخدام جملة switch بحيث يتغيّر الناتج حسب قيمة المتغير letter.

① إذا كانت القيمة A، اطبع في وحدة التحكم "Well done!"
② إذا كانت القيمة B، اطبع في وحدة التحكم "Keep up the good work"
③ إذا كانت القيمة C، اطبع في وحدة التحكم "Let's try a little harder"

الاجابة

مسح ونسخ الكود او تعديل الكود مع مراعاة السطر الثاني فارغ كما هو واضح

let letter = "B";

switch (letter) {
case "A":
console.log("Well done!");
break;
case "B":
console.log("Keep up the good work");
break;
case "C":
console.log("Let's try a little harder");
break;
}











السؤال الرابع

يُرجى اختيار ناتج الإخراج للبرنامج أدناه:

console.log(5 % 4);


الاجابة

1












السؤال الخامس

يُرجى إنشاء برنامج باستخدام جملة if يطبع "Let's eat a hamburger!" إذا كان باقي قسمة قيمة المتغير dayCount على 7 يساوي 0.


الاجابة

مسح ونسخ الكود او تعديل الكود مع مراعاة السطر الثاني فارغ كما هو واضح

let dayCount = 14;

if (dayCount % 7 == 0) {
console.log("Let's eat a hamburger!");
}












السؤال السادس

يُرجى إنشاء برنامج يطبع "Group A" إذا كان باقي قسمة المتغير number على 3 يساوي 0، و"Group B" إذا كان الباقي 1، و"Group C" إذا كان الباقي 2.
ومع ذلك، استخدم جملة switch.


الاجابة

مسح ونسخ الكود او تعديل الكود مع مراعاة السطر الثاني فارغ كما هو واضح

let number = 20;

switch (number % 3) {
case 0:
console.log("Group A");
break;
case 1:
console.log("Group B");
break;
case 2:
console.log("Group C");
break;
}







</pre>`
,
40: `<pre dir="rtl">السؤال الاول

انقر على "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط










السؤال الثاني

سنُسند القيمة 3 إلى المتغير num، ثم نُعيد إسناد 5 إليه ونطبع النتيجة في وحدة التحكم (console).
لنستخدم let في تعريف المتغير.


الاجابة

نكتب في المكان المخصص لكتابة الكود

let

ليكون شكل الكود النهائي

let num = 3;
num = 5;
console.log(num);











السؤال الثالث

سنُسند القيمة 3 إلى الثابت num، ثم نحاول إعادة إسناد 5 إليه ونطبع النتيجة في وحدة التحكم.
لنستخدم const في تعريف الثابت.


الاجابة

نكتب في المكان المخصص لكتابة الكود

const


ليكون شكل الكود النهائي

const num = 3;
num = 5;
console.log(num);







.......................................................................................................................................


الدرس الثاني


سؤال


أيٌّ مما يلي هو تعريف ثابت؟


الاجابة


const










السؤال الاول

انقر على "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط










السؤال الثاني

سنُنشئ برنامجًا يطبع عدد الأيام في الأسبوع.
في السطر الأول، باستخدام const أو let،
أعلِن عن المتغير day وامنحه القيمة 7.
*اكتب البرنامج في سطر واحد.


الاجابة

نكتب في المكان المخصص لكتابة الكود في السطر الاول

const day = 7;

شكل الكود كامل

const day = 7;
console.log("One week is " + day + " days");










السؤال الثالث

سنُنشئ برنامجًا يطبع عدد أيام الشهر الحالي.
في السطر الأول، باستخدام const أو let،
أعلِن عن المتغير day وامنحه القيمة 30.
*اكتب البرنامج في سطر واحد.


الاجابة

نكتب في المكان المخصص لكتابة الكود في السطر الاول

let day = 30;


شكل الكود بالكامل

let day = 30;
console.log("September has " + day + " days");
day = 31;
console.log("October has " + day + " days");









السؤال الرابع

سنُنشئ برنامجًا يطبع تاريخ الميلاد.
في السطر الأول، باستخدام const أو let،
أعلِن عن الثابت myBirthday وامنحه القيمة September 1st.
*اكتب البرنامج في سطر واحد.


الاجابة

نكتب في المكان المخصص لكتابة الكود في السطر الاول

const myBirthday = "September 1st";


شكل الكود بالكامل

const myBirthday = "September 1st";
console.log("My birthday is " + myBirthday);








.................................................................................................................................................


الدرس الثالث


السؤال الاول

سنُنشئ برنامجًا يطبع "Play soccer" في وحدة التحكم إذا لم تكن قيمة الثابت weather هي "Rainy".
القيمة المعطاة لـ weather هي Cloudy.

يرجى إدخال العبارة الشرطية في السطر 3 كما يلي:
if (weather != "Rainy"){
console.log("Play soccer");
}


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا مع مراعاة السطر الثاني فارغ

const weather = "Cloudy";

if (weather != "Rainy"){
console.log("Play soccer");
}











السؤال الثاني

سنُنشئ برنامجًا يطبع "Aim for a perfect score!" إذا لم تكن درجتك 100 نقطة.
يُعرّف متغير الدرجة كثابت باسم myScore.

في السطر الثالث، أدخل العبارة الشرطية التي تعني إذا لم تكن قيمة الثابت myScore مساوية لـ 100.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا مع مراعاة السطر الثاني فارغ

const myScore = 90;

if (myScore != 100){
console.log("Aim for a perfect score!");
}








.........................................................................................................................................


مراجعة المستوي 40
حل مراجعة المستوي40




السؤل الاول

يرجى كتابة تعبير الشرط لبرنامج يطبع:
"فلنراجع مرة أخرى!" عندما تكون قيم answer1 و answer2 مختلفة،
ولكن استخدم الرمز !=.


الاجابة

const num;









السؤال الثاني

يرجى اختيار طريقة الإعلان (declaration) التي يجب استخدامها عندما تكون هناك حاجة لإعادة الإسناد (reassignment).


الاجابة

let










السؤال الثالث

قم بتشغيل البرنامج وتأكيد أن هناك خطأ يظهر.
بعد التأكيد، يرجى إعادة كتابة طريقة الإعلان في السطر 1 بشكلٍ صحيح.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let num;
num = 3;
num = 5;
console.log(num);











السؤال الرابع

يرجى اختيار تعبير الشرط الذي يعني أن قيمة a ليست مساوية لـ 100 من بين الخيارات.


الاجابة

a != 100










السؤال الخامس

يرجى كتابة تعبير الشرط لبرنامج يطبع:
"فلنراجع مرة أخرى!" عندما تكون قيم answer1 و answer2 مختلفة،
ولكن استخدم الرمز !=.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا مع مراعاة السطر الثالث فارغ كما هو واضح

const answer1 = 1023;
const answer2 = 1024;

if (answer1 != answer2) {
console.log("Let's review once more!");
}






</pre>`
,
41: `<pre dir="rtl">المستوي 41

[الفصل41]جمل while


الدرس الاول


لا يوجد اسئلة


................................................................................................................................................


الدرس الثاني


السؤال الاول

انقر على "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط








السؤال الثاني

سننشئ برنامجًا يُظهر المبلغ المتبقي بعد شراء القصص المصورة، ولكن فقط عندما يكون المال الذي نملكه أكثر من سعر القصص المصورة.
يُعرَّف المال الذي نملكه على أنه المتغير money، ويُعرَّف سعر القصص المصورة على أنه الثابت comics. لقد قمنا بتعريفهما وإسناد القيم إليهما.

يرجى إكمال البرنامج في السطر 3 كما يلي:
while (money > comics) {
money = money - comics;
console.log(money);
}


الاجابة

كتابة الاكواد في الاماكن المخصصة

while

money > comics


شكل الكود بالكامل

let money = 7500;
const comics = 425;
while (money > comics) {
money = money - comics;
console.log(money);
}






.................................................................................................................................................


الدرس الثالث


سؤال


ماذا يجب أن نأكل؟


اختار مايناسبك علي سبيل المثال


هامبرغر










السؤال الاول

انقر على "تشغيل الكود" دون تعديل البرنامج.
نضغط علي تشغيل الكود فقط











السؤال الثاني

سننشئ برنامجًا يُكرر عملية ادخار المال في كل مرة حتى يصل المال إلى المبلغ المستهدف، ويُظهر عدد المرات التي تحتاج فيها إلى المساعدة.
يُعرَّف المال الذي نملكه على أنه المتغير money، ويُعرَّف عدد مرات المساعدة على أنه المتغير count.

في السطر 3، يرجى إدخال عبارة while التي تُكرر العملية طالما أن money < 3800.


الاجابة

امسح وانسخ الكود او عدل الكود ليكون هكذا

let money = 520;
let count = 0;
while (money < 3800) {
count ++;
money += 450;
}
console.log("Save for " + count + " times");






...................................................................................................................................................


مراجعة المستوي 41
حل مراجعة المستوي 41




السؤال الاول

يرجى إنشاء برنامج كما يلي:

① أطبع كلمة "Programming" في وحدة التحكم 3 مرات.
* اسم المتغير هو i، ويرجى إسناد القيمة الابتدائية 0 إليه.
* يرجى استخدام عامل الزيادة (increment operator).


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

for (let i = 0; i < 3; i++) {
console.log("Programming");
}










السؤال الثاني

يرجى اختيار الوصف الصحيح للبرنامج الذي يُكرر عمليةً طالما أن شرطًا معينًا متحقق.


الاجابة

while ( condition ) {
process;
}










السؤال الثالث

يرجى اختيار ناتج الإخراج الصحيح للبرنامج أدناه:

let numA = 0;
let numB = 3;
while (numA < numB) {
console.log(numA);
numA = numA + 1;
}


الاجابة

0
1
2










السؤال الرابع

لقد أنشأنا برنامجًا للتحقق من عدد الوجبات الخفيفة التي يمكن شراؤها بالمبلغ المتاح.
يُعرَّف المال الذي نملكه بالمتغير money وتُسنَد إليه القيمة 1000.
ويُعرَّف سعر الوجبات الخفيفة بالثابت snacks وتُسنَد إليه القيمة 230.

يرجى إنشاء برنامج باستخدام عبارة while يكرر العملية طالما أن المال الذي نملكه أكبر من سعر الوجبات الخفيفة.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let money = 1000;
const snacks = 230;
while (money > snacks) {
money = money - snacks;
console.log(money);
}










السؤال الخامس

سننشئ برنامجًا يُظهر عدد الأشهر المطلوبة للادخار حتى الوصول إلى المبلغ المستهدف 4000 كودي كوين.
يُعرَّف المال الذي نملكه بالمتغير money وتُسنَد إليه القيمة 600.
ويُعرَّف عدد الأشهر بالمتغير month وتُسنَد إليه القيمة 0.

يرجى إنشاء برنامج باستخدام عبارة while يكرر العملية طالما أن المال الذي نملكه أقل من المبلغ المستهدف 4000.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let money = 600;
let month = 0;
while (money < 4000) {
month ++;
money += 800;
}
console.log("Save for " + month + " months");









</pre>`
,
42: `<pre dir="rtl">المستوي 42

[الدرس1]مراجعة الفصلين 40 و41


سؤال


أيٌّ منها هو تعريف ثابت (constant)؟


الاجابة


const










السؤال الاول

سننشئ برنامجًا يُظهر الفصل الحالي.

في السطر 1، باستخدام const أو let،
قم بتعريف المتغير season.
* يُرجى كتابة البرنامج في سطر واحد.


الاجابة

نكتب في المكان المخصص لكتابة الكود

let


شكل الكود بالكامل

let season = "spring";
console.log("The current season is " + season);
season = "summer";
console.log("The next season is " + season);










السؤال الثاني

سننشئ برنامجًا يُظهر عدد الأيام في الأسبوع.

في السطر 1، باستخدام const أو let،
قم بتعريف المتغير day وأسند إليه القيمة 7.
* يُرجى كتابة البرنامج في سطر واحد.


الاجابة

نكتب في المكان المخصص لكتابة الكود في السطر الاول

const day = 7;


شكل الكود النهائي

const day = 7;
console.log("One week is " + day + " days");












السؤال الثالث

سننشئ برنامجًا يُظهر "Play soccer" في وحدة التحكم إذا كانت قيمة الثابت weather لا تساوي Rainy.
وقد أُسنِدت القيمة Cloudy إلى weather.

يُرجى إدخال تعبير الشرط في السطر 3 كما يلي:
if (weather != "Rainy"){
console.log("Play soccer");
}


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا مع مراعاة السطر الثاني فارغ كما واضح

const weather = "Cloudy";

if (weather != "Rainy"){
console.log("Play soccer");
}











السؤال الرابع

سننشئ برنامجًا يُكرر عملية الادخار في كل مرة حتى يصل المال إلى المبلغ المستهدف،
ويُظهر عدد المرات التي تحتاج فيها إلى المساعدة.

يُعرَّف المال الذي نملكه بالمتغير money،
ويُعرَّف عدد المرات بالمتغير count.

في السطر 3، يُرجى إدخال عبارة while التي تُكرر العملية طالما أن money < 3800.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let money = 520;
let count = 0;
while (money < 3800) {
count ++;
money += 450;
}
console.log("Save for " + count + " times");








...........................................................................................................................................


اختبار منتصف الطريق المستوي 42
حل اختبار منتصف الطريق المستوي42
حل مراجعة المستوي 42


السؤال الاول

يرجى اختيار طريقة التعريف التي تُستخدم عندما تكون هناك حاجة إلى إعادة الإسناد.


الاجابة

let











السؤال الثاني

شغّل البرنامج وتأكد من أن هناك خطأ يحدث.
بعد التأكيد، يُرجى إعادة كتابة طريقة التعريف في السطر 1 بشكلٍ صحيح.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let num;
num = 3;
num = 5;
console.log(num);











السؤال الثالث

يرجى اختيار تعبير الشرط الذي يُمثِّل أن قيمة a لا تساوي 100 من الخيارات.


الاجابة

a != 100












السؤال الرابع

يرجى اختيار الوصف الصحيح للبرنامج الذي يُكرر عمليةً طالما أن الشرط متحقق.


الاجابة

while ( condition ) {
process;
}












السؤال الخامس

يرجى اختيار الوصف الصحيح للبرنامج الذي يُكرر عمليةً طالما أن الشرط متحقق.

لقد أنشأنا برنامجًا للتحقق من عدد الوجبات الخفيفة التي يمكن شراؤها بالمبلغ المتاح.
يُعرَّف المال الذي نملكه بالمتغير money وتُسنَد إليه القيمة 1000.
ويُعرَّف سعر الوجبات الخفيفة بالثابت snacks وتُسنَد إليه القيمة 230.

يرجى إنشاء برنامج باستخدام عبارة while يُكرر العملية طالما أن المال الذي نملكه أكبر من سعر الوجبات الخفيفة.


الاجابة

مسح ونسخ الكود او تعديل الكود ليكون هكذا

let money = 1000;
const snacks = 230;
while (money > snacks) {
money = money - snacks;
console.log(money);
}











السؤال السادس

سننشئ برنامجًا يُظهر عدد الأشهر المطلوبة للادخار للوصول إلى المبلغ المستهدف 4000 كودي كوين.
يُعرَّف المال الذي نملكه بالمتغير money وتُسنَد إليه القيمة 600.
ويُعرَّف عدد الأشهر بالمتغير month وتُسنَد إليه القيمة 0.

يرجى إنشاء برنامج باستخدام عبارة while يُكرر العملية طالما أن المال الذي نملكه أقل من المبلغ المستهدف 4000.


الاجابة

مسح ونسخ لكود او تعديل الكود ليكون هكذا

let money = 600;
let month = 0;content://com.android.externalstorage.documents/tree/primary%3ADocuments%2Fnilecrest::primary:Documents/nilecrest/index.html/index.html
while (money < 4000) {
month ++;
money += 800;
}
console.log("Save for " + month + " months");






</pre>`
};


// نملأ بقية المستويات بنصوص فارغة مؤقتاً (يمكن إضافة نصوص حقيقية لاحقاً)
// for(let i=22; i<=42; i++){
//   levelContentData[i] = `<p dir="rtl">نص المستوى ${i}</p>`;
// }

/* إنشاء الكروت والقائمة */
for(let i=startLevel; i<=endLevel; i++){
  let card = document.createElement("div");
  card.className="card";
  card.innerText="المستوى " + i;
  card.onclick=()=>openLevel(i);
  cardsContainer.appendChild(card);

  let li = document.createElement("li");
  li.innerText="المستوى " + i;
  li.onclick=()=>openLevel(i);
  levelsList.appendChild(li);
}

/* فتح مستوى */
function openLevel(level){
  levelsPage.style.display="none";
  dashboard.style.display="block";
  homeBtn.style.display="block";

  header.innerText="حلول المستوى " + level;

  if(levelContentData[level]){
    levelText.innerHTML = levelContentData[level];
  } else {
    levelText.innerHTML = "<p dir='rtl'>لا يوجد محتوى لهذا المستوى بعد.</p>";
  }

  copyMsg.style.display="none";
}

/* الرجوع للرئيسية */
function goHome(){
  dashboard.style.display="none";
  levelsPage.style.display="flex";
  homeBtn.style.display="none";
  header.innerText="حل اسئلة منصة quero";
}

/* نسخ المحتوى */
function copyText(){
  const content = levelText.innerText;
  navigator.clipboard.writeText(content).then(()=>{
    copyMsg.style.display="block";
    setTimeout(()=>{ copyMsg.style.display="none"; },2000);
  });
}